index.org
#+title: A tour of CPPZMQ, the C++ bindings to libzmq
#+AUTHOR: Brett Viren
#+EMAIL: brett.viren@gmail.com
#+OPTIONS:   H:4 num:nil toc:2
#+SETUPFILE: setup/theme-readtheorg-local.setup
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>
#+LINK: api http://api.zeromq.org/master:%s
#+MACRO: zman [[http://api.zeromq.org/master:$1][~$1($2)~]]
#+MACRO: czman [[http://czmq.zeromq.org/czmq4-0:$1][~$1($2)~]]

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: intro
  :ID: intro
  :END:

The [[https://zeromq.org/][ZeroMQ]] project [[https://github.com/zeromq/cppzmq][cppzmq]] provides C++ bindings for [[https://github.com/zeromq/libzmq/][libzmq]].  With them we can exercise the power of ZeroMQ with idiomatic, modern C++.  The bindings provide type safety, exception-based error reporting, and the RAII approach to resource management.  Most *cppzmq* functionality will work with C++11 and even older and here we consider features requiring C++17 and we ignore deprecated interfaces.

** This document

In this document, I tour the main parts of the *cppzmq* package so I can learn them better.  I write down what I learn along the way so maybe others can learn something too.

Brevity is attempted and so the general concepts of ZeroMQ are assumed to already be understood.  If you, the curious reader, have not yet done so please do yourself a big favor and read the entire [[http://zguide.zeromq.org/][ZeroMQ Guide]].  Read it at least twice.  I think gets even better each time I read it as I find something new and useful that I had previously missed.

This tour may not be needed by everyone.  We may make effective use of *cppzmq* simply by reading its header files and maybe checking the unit tests.  In some cases we may also need to refer to the *libzmq* API documentation which should be installed on your system as Unix man pages (~man zmq~ to start) and which are available [[http://api.zeromq.org/][online]].  This document attempts to distill what was learned in the process of just such a reading.  I hope it may serve as a gentle narrative or tour that will help others quickly feel comfortable developing with *cppzmq*.

#+begin_note
The source for this document may be found at https://github.com/brettviren/cppzmq-tour.  Corrections, particularly in the form of pull requests, are welcome.  
#+end_note


** Project contents

The *cppzmq* package core is a header-only library providing the C++ ~namespace zmq::~.  Currently the library consists of two headers and here is a summary of what they provide:

- [[https://github.com/zeromq/cppzmq/blob/master/zmq.hpp][~zmq.hpp~]] :: (single part) message, context, buffer, socket, monitor, poller
- [[https://github.com/zeromq/cppzmq/blob/master/zmq_addon.hpp][~zmq_addon.hpp~]] :: multipart and related functions and another form of poller

Most of the goodies are in ~zmq.hpp~ and we go through them in the order they appear in that file.  The goodies in ~zmq_addon.hpp~ are just as good and I feel there's no need for a separation.  All my *cppzmq* projects benefit from both.

The package also provides substantial unit tests which can be mined for programming examples.  The package [[https://github.com/zeromq/cppzmq/blob/master/README.md][README]] file gives instructions for formal installation but one very simple option is copying the ~zmq.hpp~ and ~zmq_addon.hpp~ files right into our own package.

* Messages
  :PROPERTIES:
  :CUSTOM_ID: messages
  :END:

The ~message_t~ class from ~zmq.hpp~ is a C++ facade over an opaque ~zmq_msg_t~ from *libzmq*.  It is conceptually equivalent to the {{{czman(zframe,3)}}} from [[http://czmq.zeromq.org/][CZMQ]], the high level C bindings to *libzmq*.  In ZeroMQ terms, ~message_t~ is a /single-part/ message in that it holds a contiguous block of memory.  Later, (sections [[Socket]] and [[Multipart]]) the idea of multiple single-part messages and multipart messages are covered.

** Creating messages
   :PROPERTIES:
   :CUSTOM_ID: creating-messages
   :END:

Here are some examples of constructing a ~message_t~:

#+begin_src c++
  // Default constructs an empty message of size zero.
  zmq::message_t msg;

  // Have message allocate some memory internally.
  const size_t size = 1024;
  zmq::message_t msg(size);

  // Initialize internal memory with a copy of external data.
  const char bytes[s] = {0};
  zmq::message_t msg(bytes, size);

  // Or, from string literal (see also str_buffer).
  zmq::message_t msg("hello world!", 12);

  // Initialize through iteration on a container.
  std::vector<int> ivec = {1,2,3};
  zmq::message_t msg(ivec.begin(), ivec.end());
  // or more simply
  zmq::message_t msg(ivec);
  
  // Zero-copy provision with custom deallocation callback.
  // Wraps zmq_msg_init_data(3), see man page for details.
  zmq::message_t msg(byte, size, myfree, nullptr);

  // Move/swap the data of one message into a new one
  zmq::message_t msg2(msg);
  // or
  zmq::message_t msg2 = msg;

#+end_src


