index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-15 Wed 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A tour of CPPZMQ, the C++ bindings to libzmq</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">A tour of CPPZMQ, the C++ bindings to libzmq</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#intro">Introduction</a>
<ul>
<li><a href="#orgc61499e">This document</a></li>
<li><a href="#org1b5c722">Project contents</a></li>
</ul>
</li>
<li><a href="#messages">Messages</a>
<ul>
<li><a href="#creating-messages">Creating messages</a></li>
<li><a href="#resetting-messages">Resetting the message</a></li>
<li><a href="#message-data">Accessing data in a message</a></li>
<li><a href="#message-metadata">Message metadata</a></li>
</ul>
</li>
<li><a href="#buffers">Buffers</a>
<ul>
<li><a href="#orgbdc78d9">Buffer types</a></li>
<li><a href="#orgcc08f3c">Buffer construction</a></li>
<li><a href="#orgd2509b7">Buffer operations</a></li>
<li><a href="#orgea466aa">Access buffer data</a></li>
</ul>
</li>
<li><a href="#context">Context</a>
<ul>
<li><a href="#create-context">Creating a context</a></li>
<li><a href="#context-life">Context life cycle</a></li>
</ul>
</li>
<li><a href="#sockets">Socket</a>
<ul>
<li><a href="#socket-life">Socket life cycle</a></li>
<li><a href="#socket-link">Socket linkage</a></li>
<li><a href="#org3e50177">Sending</a></li>
<li><a href="#org3a79e67">Receiving</a></li>
<li><a href="#orgd077f1e">Socket options</a></li>
<li><a href="#org955cdae">Socket properties</a></li>
<li><a href="#orga25afc6">Socket references</a></li>
<li><a href="#orga0e439b">Socket handle</a></li>
</ul>
</li>
<li><a href="#monitor">Monitor</a></li>
<li><a href="#poller">Poller</a>
<ul>
<li><a href="#orgfa6c417"><code>zmq::poller_t</code></a></li>
<li><a href="#org8705484">Interlude</a></li>
<li><a href="#org2a8f3ae"><code>zmq::active_poller_t</code></a></li>
</ul>
</li>
<li><a href="#multipart">Multipart</a>
<ul>
<li><a href="#orgefd4893">Multiple messages</a></li>
<li><a href="#org447af4e">Multipart messages</a></li>
<li><a href="#codec">Codec</a></li>
</ul>
</li>
<li><a href="#org74f4fee">FIN</a></li>
</ul>
</div>
</div>

<div id="outline-container-org424b11d" class="outline-2">
<h2 id="intro">Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
The <a href="https://zeromq.org/">ZeroMQ</a> project <a href="https://github.com/zeromq/cppzmq">cppzmq</a> provides C++ bindings for <a href="https://github.com/zeromq/libzmq/">libzmq</a>.  With them we can exercise the power of ZeroMQ with idiomatic, modern C++.  The bindings provide type safety, exception-based error reporting, the RAII approach to resource management.  Most <b>cppzmq</b> functionality will work with C++11 and even older and here we consider features requiring C++17 and we ignore deprecated interfaces.
</p>
</div>

<div id="outline-container-orgc61499e" class="outline-3">
<h3 id="orgc61499e">This document</h3>
<div class="outline-text-3" id="text-orgc61499e">
<p>
In this document, I tour the main parts of the <b>cppzmq</b> package so I can learn them better.  I write down what I learn along the way so maybe others can learn something too.
</p>

<p>
Brevity is attempted and so the general concepts of ZeroMQ are assumed to already be understood.  If you, the curious reader, have not yet done so please do yourself a big favor and read the entire <a href="http://zguide.zeromq.org/">ZeroMQ Guide</a>.  Read it at least twice.  I think gets even better each time I read it as I find something new and useful that I had previously missed.
</p>

<p>
This tour may not be needed by everyone.  We may make effective use of <b>cppzmq</b> simply by reading its header files and maybe checking the unit tests.  In some cases we may also need to refer to the <b>libzmq</b> API documentation which should be installed on your system as Unix man pages (<code>man zmq</code> to start) and which are available <a href="http://api.zeromq.org/">online</a>.  This document attempts to distill what was learned in the process of just such a reading.  I hope it may serve as a gentle narrative or tour that will help others quickly feel comfortable developing with <b>cppzmq</b>.
</p>

<div class="note">
<p>
The source for this document may be found at <a href="https://github.com/brettviren/cppzmq-tour">https://github.com/brettviren/cppzmq-tour</a>.  Corrections, particularly in the form of pull requests, are welcome.  
</p>

</div>
</div>
</div>


<div id="outline-container-org1b5c722" class="outline-3">
<h3 id="org1b5c722">Project contents</h3>
<div class="outline-text-3" id="text-org1b5c722">
<p>
The <b>cppzmq</b> package core is a header-only library providing the C++ <code>namespace zmq::</code>.  Currently the library consists of two headers and here is a summary of what they provide:
</p>

<dl class="org-dl">
<dt><a href="https://github.com/zeromq/cppzmq/blob/master/zmq.hpp"><code>zmq.hpp</code></a></dt><dd>(single part) message, context, buffer, socket, monitor, poller</dd>
<dt><a href="https://github.com/zeromq/cppzmq/blob/master/zmq_addon.hpp"><code>zmq_addon.hpp</code></a></dt><dd>multipart and related functions and another form of poller</dd>
</dl>

<p>
Most of the goodies are in <code>zmq.hpp</code> and we go through them in order they appear in that file.  The goodies in <code>zmq_addon.hpp</code> are just as good and I feel there's no need for a separation.  All my <b>cppzmq</b> projects benefit from both.
</p>

<p>
The package also provides substantial unit tests which can be mined for programming examples.  The package <a href="https://github.com/zeromq/cppzmq/blob/master/README.md">README</a> file gives instructions for formal installation but one very simple option is copying the <code>zmq.hpp</code> and <code>zmq_addon.hpp</code> files right into our own package.
</p>
</div>
</div>
</div>

<div id="outline-container-org17f5d38" class="outline-2">
<h2 id="messages">Messages</h2>
<div class="outline-text-2" id="text-messages">
<p>
The <code>message_t</code> class from <code>zmq.hpp</code> is a C++ facade over an opaque <code>zmq_msg_t</code> from <b>libzmq</b>.  It is conceptually equivalent to the <a href="http://czmq.zeromq.org/czmq4-0:zframe"><code>zframe(3)</code></a> from <a href="http://czmq.zeromq.org/">CZMQ</a>, the high level C bindings to <b>libzmq</b>.  In ZeroMQ terms, <code>message_t</code> is a <i>single-part</i> message in that it holds a contiguous block of memory.  Later, (sections <a href="#sockets">Socket</a> and <a href="#multipart">Multipart</a>) the idea of multiple single-part messages and multipart messages are covered.
</p>
</div>

<div id="outline-container-org0c76745" class="outline-3">
<h3 id="creating-messages">Creating messages</h3>
<div class="outline-text-3" id="text-creating-messages">
<p>
Here are some examples of constructing a <code>message_t</code>:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Default constructs an empty message of size zero.</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span>;

<span style="color: #73d216;">// </span><span style="color: #73d216;">Have message allocate some memory internally.</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">size_t</span> <span style="color: #fcaf3e;">size</span> = 1024;
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fce94f;">msg</span>(size);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Initialize internal memory with a copy of external data.</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">char</span> <span style="color: #fcaf3e;">bytes</span>[s] = {0};
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fce94f;">msg</span>(bytes, size);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Or, from string literal (see also str_buffer).</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span>(<span style="color: #e9b96e;">"hello world!"</span>, 12);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Initialize through iteration on a container.</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #8cc4ff;">int</span>&gt; <span style="color: #fcaf3e;">ivec</span> = {1,2,3};
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fce94f;">msg</span>(ivec.begin(), ivec.end());
<span style="color: #73d216;">// </span><span style="color: #73d216;">or more simply</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fce94f;">msg</span>(ivec);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Zero-copy provision with custom deallocation callback.</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">Wraps zmq_msg_init_data(3), see man page for details.</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span>(byte, size, myfree, <span style="color: #e9b2e3;">nullptr</span>);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Move/swap the data of one message into a new one</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fce94f;">msg2</span>(msg);
<span style="color: #73d216;">// </span><span style="color: #73d216;">or</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg2</span> = msg;

</pre>
</div>
</div>
</div>
