index.org
** Resetting the message 
   :PROPERTIES:
   :CUSTOM_ID: resetting-messages
   :END:

We can also "rebuild" an existing message.  The methods to do this mirror the constructor prototypes:

#+begin_src c++
  // Empty the message
  msg.rebuild();

  // Allocate a new size
  msg.rebuild(size);

  // Allocate and set with a copy
  msg.rebuild(bytes, size);
#+end_src

Not included here is a zero-copy version similar to the zero-copy constructor shown above.

** Accessing data in a message
   :PROPERTIES:
   :CUSTOM_ID: message-data
   :END:


The message is a block of bytes and we can get at those bytes in a few ways:

#+begin_src c++
  // Size of the data in bytes 
  size_t msg.size();

  // Low level, type free access
  const void* vptr = msg.data();

  // As above but type cast
  const int* iptr = msg.data<int>();

  // With a copy into a non-const collection
  std::vector ints(msg.data<int>(), msg.size()/sizeof(int));

  // If the data makes sense as a string.
  std::string str = msg.to_string();

  // And we can get a zero copy view.
  std::string_view strv = msg.to_string_view();

  // An artistic string representation of the contents.
  std::cout << msg.str() << std::endl;
#+end_src

** Message metadata
   :PROPERTIES:
   :CUSTOM_ID: message-metadata
   :END:

Here we have a few details that are specific to certain socket types.  We still haven't gotten to sockets, but they are coming.  You may feel comfortable to skip this section for now.

*** SERVER Routing ID

When we receive and send messages via a socket of type *SERVER* our application must manage a "routing ID" in order to associate the messages with a remote *CLIENT* socket.  We do this by getting and setting this ID from/on the message as:

#+begin_src c++
  // After we receive a message, remember its routing ID:
  uint32_t rid = msg.routing_id();

  // Later, just before sending, we make sure to set the ID:
  zmq::message_t msg2;
  msg2.set_routing_id(rid);
#+end_src

In this example, two messages are used.  If the received message is reused for the subsequent send, and we have not rebuilt it, the routing ID is retained and no explicit get/set is required.  

*** Broadcast Groups

The *RADIO/DISH* sockets have a concept similar to *SERVER/CLIENT* routing ID and *PUB/SUB* /topics/ which is that of a named /group/ to which messages are associated.  This group name may be set on and retrieved from the message.

#+begin_src c++
  // 16 byte max including null '\0' terminator char
  const char* grp = "hello world!";
  msg.set_group(grp);

  // Get the group name.
  grp = msg.group();
#+end_src

*** Metadata Properties

More generally, messages may carry per-connection metadata "properties".  The keys and values for these are of type string.  We'll describe how these may be set through [[Socket][socket options]] later but for now here is an example of how properties may be retrieved.

#+begin_src c++
  // Get system property 
  const char* stype = msg.gets("Socket-Type");

  // Get an application property
  const char* color = msg.gets("X-Favorite-Color");
#+end_src

This ~gets()~ method wraps {{{zman(zmq_msg_gets,3)}}} so see that man page for details.


* Buffers
  :PROPERTIES:
  :CUSTOM_ID: buffers
  :END:


In *cppzmq*, a buffer is like a message, but different.  It allows us another way to transmit data without creating a message, or it gives us easier ways to create a message from our data.

** Buffer types

There are two variants of buffers, ~mutable_buffer~ and ~const_buffer~.  As the name suggests, the data given to the first may be modified while the data given to the second may not be.  

** Buffer construction

Either type of buffer may be constructed directly as in this example:

#+begin_src c++
  // Empty 
  zmq::mutable_buffer mbuf();
  zmq::const_buffer cbuf();

  // Fodder data
  const size_t size = 1024;
  void* ptr = malloc(size);
  const void* cptr = ptr;

  // With data
  zmq::mutable_buffer mbuf(ptr, size);
  zmq::const_buffer cbuf(cptr, size);

#+end_src

We are also given a variety of functions named ~buffer()~ to construct buffers in useful ways.  We give some examples next and will see later some examples of how to use buffers in the sections [[Socket]] and [[Multipart]].

#+begin_src c++
  // Fodder data from previous example

  // Basic construction
  zmq::mutable_buffer mbuf = zmq::buffer(ptr, size);
  zmq::const_buffer cbuf = zmq::buffer(cptr, size);

  // C array. 
  int data[1024];
  mbuf = zmq::buffer(data);

  // C++ vector, std::array is similar
  std::vector<int> data(size);
  mbuf = zmq::buffer(data);

  // C++ string and string literal
  std::string str = "hello world";
  mbuf = zmq::buffer(str);
  cbuf = zmq::str_buffer("hello world");
#+end_src

