index.html


<div id="outline-container-org7022afd" class="outline-3">
<h3 id="resetting-messages">Resetting the message</h3>
<div class="outline-text-3" id="text-resetting-messages">
<p>
We can also "rebuild" an existing message.  The methods to do this mirror the constructor prototypes:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Empty the message</span>
msg.rebuild();

<span style="color: #73d216;">// </span><span style="color: #73d216;">Allocate a new size</span>
msg.rebuild(size);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Allocate and set with a copy</span>
msg.rebuild(bytes, size);
</pre>
</div>

<p>
Not included here is a zero-copy version similar to the zero-copy constructor shown above.
</p>
</div>
</div>

<div id="outline-container-org63f788c" class="outline-3">
<h3 id="message-data">Accessing data in a message</h3>
<div class="outline-text-3" id="text-message-data">
<p>
The message is a block of bytes and we can get at those bytes in a few ways:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Size of the data in bytes </span>
<span style="color: #8cc4ff;">size_t</span> <span style="color: #fce94f;">msg</span>.size();

<span style="color: #73d216;">// </span><span style="color: #73d216;">Low level, type free access</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">void</span>* <span style="color: #fcaf3e;">vptr</span> = msg.data();

<span style="color: #73d216;">// </span><span style="color: #73d216;">As above but type cast</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">int</span>* <span style="color: #fcaf3e;">iptr</span> = msg.data&lt;<span style="color: #8cc4ff;">int</span>&gt;();

<span style="color: #73d216;">// </span><span style="color: #73d216;">With a copy into a non-const collection</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span> <span style="color: #fce94f;">ints</span>(msg.data&lt;<span style="color: #8cc4ff;">int</span>&gt;(), msg.size()/<span style="color: #b4fa70;">sizeof</span>(<span style="color: #8cc4ff;">int</span>));

<span style="color: #73d216;">// </span><span style="color: #73d216;">If the data makes sense as a string.</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string</span> <span style="color: #fcaf3e;">str</span> = msg.to_string();

<span style="color: #73d216;">// </span><span style="color: #73d216;">And we can get a zero copy view.</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string_view</span> <span style="color: #fcaf3e;">strv</span> = msg.to_string_view();

<span style="color: #73d216;">// </span><span style="color: #73d216;">An artistic string representation of the contents.</span>
<span style="color: #e9b2e3;">std</span>::cout &lt;&lt; msg.str() &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
</pre>
</div>
</div>
</div>

<div id="outline-container-org06e1bd3" class="outline-3">
<h3 id="message-metadata">Message metadata</h3>
<div class="outline-text-3" id="text-message-metadata">
<p>
Here we have a few details that are specific to certain socket types.  We still haven't gotten to sockets, but they are coming.  You may feel comfortable to skip this section for now.
</p>
</div>

<div id="outline-container-orgfcc089f" class="outline-4">
<h4 id="orgfcc089f">SERVER Routing ID</h4>
<div class="outline-text-4" id="text-orgfcc089f">
<p>
When we receive and send messages via a socket of type <b>SERVER</b> our application must manage a "routing ID" in order to associate the messages with a remote <b>CLIENT</b> socket.  We do this by getting and setting this ID from/on the message as:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">After we receive a message, remember its routing ID:</span>
<span style="color: #8cc4ff;">uint32_t</span> <span style="color: #fcaf3e;">rid</span> = msg.routing_id();

<span style="color: #73d216;">// </span><span style="color: #73d216;">Later, just before sending, we make sure to set the ID:</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg2</span>;
msg2.set_routing_id(rid);
</pre>
</div>

<p>
In this example, two messages are used.  If the received message is reused for the subsequent send, and we have not rebuilt it, the routing ID is retained and no explicit get/set is required.  
</p>
</div>
</div>

<div id="outline-container-org0502cd7" class="outline-4">
<h4 id="org0502cd7">Broadcast Groups</h4>
<div class="outline-text-4" id="text-org0502cd7">
<p>
The <b>RADIO/DISH</b> sockets have a concept similar to <b>SERVER/CLIENT</b> routing ID and <b>PUB/SUB</b> <i>topics</i> which is that of a named <i>group</i> to which messages are associated.  This group name may be set on and retrieved from the message.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">16 byte max including null '\0' terminator char</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">char</span>* <span style="color: #fcaf3e;">grp</span> = <span style="color: #e9b96e;">"hello world!"</span>;
msg.set_group(grp);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Get the group name.</span>
grp = msg.group();
</pre>
</div>
</div>
</div>

<div id="outline-container-org6174942" class="outline-4">
<h4 id="org6174942">Metadata Properties</h4>
<div class="outline-text-4" id="text-org6174942">
<p>
More generally, messages may carry per-connection metadata "properties".  The key and values for these are of type string.  We'll describe how these may be set through <a href="#sockets">socket options</a> later but for now here is an example of how properties may be retrieved.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Get system property </span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">char</span>* <span style="color: #fcaf3e;">stype</span> = msg.gets(<span style="color: #e9b96e;">"Socket-Type"</span>);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Get an application property</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">char</span>* <span style="color: #fcaf3e;">color</span> = msg.gets(<span style="color: #e9b96e;">"X-Favorite-Color"</span>);
</pre>
</div>

<p>
This <code>gets()</code> method wraps <a href="http://api.zeromq.org/master:zmq_msg_gets"><code>zmq_msg_gets(3)</code></a> so see that man page for details.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org3ff15c7" class="outline-2">
<h2 id="buffers">Buffers</h2>
<div class="outline-text-2" id="text-buffers">
<p>
In <b>cppzmq</b>, a buffer is like a message, but different.  It allows us another way to transmit data without creating a message or to gives us easier ways to create a message from our data.
</p>
</div>

<div id="outline-container-orgbdc78d9" class="outline-3">
<h3 id="orgbdc78d9">Buffer types</h3>
<div class="outline-text-3" id="text-orgbdc78d9">
<p>
There are two variants of buffers, <code>mutable_buffer</code> and <code>const_buffer</code>.  As the name suggests, the data given to the first may be modified while the data given to the second may not be.  
</p>
</div>
</div>

<div id="outline-container-orgcc08f3c" class="outline-3">
<h3 id="orgcc08f3c">Buffer construction</h3>
<div class="outline-text-3" id="text-orgcc08f3c">
<p>
Either type of buffer may be constructed directly as in this example:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Empty </span>
<span style="color: #8cc4ff;">mutable_buffer</span> <span style="color: #fce94f;">mbuf</span>();
<span style="color: #8cc4ff;">const_buffer</span> <span style="color: #fce94f;">cbuf</span>();

<span style="color: #73d216;">// </span><span style="color: #73d216;">Fodder data</span>
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">size_t</span> <span style="color: #fcaf3e;">size</span> = 1024;
<span style="color: #8cc4ff;">void</span>* <span style="color: #fcaf3e;">ptr</span> = malloc(size);
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">void</span>* <span style="color: #fcaf3e;">cptr</span> = ptr;

<span style="color: #73d216;">// </span><span style="color: #73d216;">With data</span>
<span style="color: #8cc4ff;">mutable_buffer</span> <span style="color: #fce94f;">mbuf</span>(ptr, size);
<span style="color: #8cc4ff;">const_buffer</span> <span style="color: #fce94f;">cbuf</span>(cptr, size);

</pre>
</div>

<p>
We are also given a variety of functions named <code>buffer()</code> to construct buffers in useful ways.  We give some examples next and will see later some examples of how to use buffers in the sections <a href="#sockets">Socket</a> and <a href="#multipart">Multipart</a>.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Fodder data from previous example</span>

<span style="color: #73d216;">// </span><span style="color: #73d216;">Basic construction</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">mutable_buffer</span> <span style="color: #fcaf3e;">mbuf</span> = <span style="color: #e9b2e3;">zmq</span>::buffer(ptr, size);
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">const_buffer</span> <span style="color: #fcaf3e;">cbuf</span> = <span style="color: #e9b2e3;">zmq</span>::buffer(cptr, size);

<span style="color: #73d216;">// </span><span style="color: #73d216;">C array. </span>
<span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">data</span>[1024];
mbuf = <span style="color: #e9b2e3;">zmq</span>::buffer(data);

<span style="color: #73d216;">// </span><span style="color: #73d216;">C++ vector, std::array is similar</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #8cc4ff;">int</span>&gt; <span style="color: #fce94f;">data</span>(size);
mbuf = <span style="color: #e9b2e3;">zmq</span>::buffer(data);

<span style="color: #73d216;">// </span><span style="color: #73d216;">C++ string and string literal</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string</span> <span style="color: #fcaf3e;">str</span> = <span style="color: #e9b96e;">"hello world"</span>;
mbuf = <span style="color: #e9b2e3;">zmq</span>::buffer(str);
cbuf = <span style="color: #e9b2e3;">zmq</span>::str_buffer(<span style="color: #e9b96e;">"hello world"</span>);
</pre>
</div>
</div>
</div>
