index.org
** Buffer operations

Once constructed, buffers are rather simple but we can operate on them to narrow their view of the underlying data.

   #+begin_src c++
  // Truncate tail half, same works with const_buffer
  mbuf = zmq::buffer(mbuf, mbuf.size()/2);
  // Truncate front half, etc cbuf.
  mbuf += mbuf.size()/2;
   #+end_src

Why do this narrowing?  One very useful pattern is for an application to take some action based on the prefix or postfix of a message.  This narrowing can be performed after this information is used and the remainder can be forwarded to an output socket.  No copying needed.

** Access buffer data

Unlike a message, a buffer has only a basic pair of methods to get back the original data and its size, reflecting any narrowing that occurred.

#+begin_src c++
  void *vptr = mbuf.data();
  size_t size = mbuf.size();
#+end_src

And, that's about it.

* Context
  :PROPERTIES:
  :CUSTOM_ID: context
  :END:

The ~context_t~ from ~zmq.hpp~ embodies an opaque *libzmq* context such as created by {{{zman(zmq_ctx_new,3)}}}.  A context is used by ZeroMQ to collect and manage a set of sockets which the application creates on/in the context.  The context is thread safe (unlike some sockets) and may be shared between threads without concern for locking at the application level.  

** Creating a context
   :PROPERTIES:
   :CUSTOM_ID: create-context
   :END:


Almost always we create the default context:

#+begin_src c++
  zmq::context_t ctx;
#+end_src

A move constructor is also available.  After construction, various context options may be set and queried and *cppzmq* provides ~ctx.set()~ and ~ctx.get()~ to do this.  I have yet to use them but we may check {{{zman(zmq_ctx_set,3)}}} for anything interesting.

** Context life cycle
   :PROPERTIES:
   :CUSTOM_ID: context-life
   :END:

We can not copy a context but we can move.   Typically, we will construct it, keep it alive as long as we need the sockets that we have created with it and if we need it in some other code context we may pass it by reference.  Here is a contrived example.

#+begin_src c++
  void run_app(zmq::context_t& ctx);

  void main()
  {
      zmq::context_t ctx;
      run_app(ctx);
  }
#+end_src

In most applications, we will let the ~context_t~ destruct and that will tear down our sockets.  We may also tear down even sooner:

#+begin_src c++
  // Cease any blocking operations in progress.
  ctx.shutdown();

  // Do a shutdown, if needed and destroy the context.
  ctx.close();
#+end_src


* Socket
  :PROPERTIES:
  :CUSTOM_ID: sockets
  :END:

The heart of ZeroMQ is the socket and for it *cppzmq* supplies us with the class ~socket_t~.  There exists too much useful information on the intriguing variety of ZeroMQ sockets to repeat here.  A concise and definitive source is {{{zman(zmq_socket,3)}}}.  Really, read that carefully as it answers a large fraction of questions I have had and see asked by others.

** Socket life cycle
   :PROPERTIES:
   :CUSTOM_ID: socket-life
   :END:


To be useful, sockets must be created with a *context* (which we covered in section [[Context]]) and a socket type identifier.  In *libzmq* the type is identified with an integer, usually as provided by a CPP macro like ~ZMQ_PUB~.  In *cppzmq* (in C++11) we may still use these macros or bare integers or we may use an ~enum class socket_type~.

#+begin_src c++
  using namespace zmq;
  context_t ctx;
  socket_t pub(ctx, ZMQ_PUB);
  socket_t sub(ctx, socket_type::sub);
#+end_src

A default socket may be constructed and later swap guts with another socket through a move assignment.  A socket may also be move-constructed.  But we can not copy a socket.   

#+begin_caution
Not just for *cppzmq*, we must take care that all ZeroMQ sockets besides *SERVER*, *CLIENT*, *RADIO* and *DISH* must not be used from any thread other than the one in which they were created.  Some caveats apply but best thing is just don't do it.
#+end_caution

When a socket destructs or if its ~socket_t::close()~ method is explicitly called, the underlying *libzmq* socket will be destroyed via {{{zman(zmq_close,3)}}}.  

** Socket linkage
   :PROPERTIES:
   :CUSTOM_ID: socket-link
   :END:

ZeroMQ sockets link up with each other via transport addresses (see eg {{{zman(zmq_tcp,7)}}}, {{{zman(zmq_ipc,7)}}}, {{{zman(zmq_inproc,7)}}}).  One or more sockets may "bind" to an address and one or more may "connect".  At least one of each type of link must be made for messages to be exchanged.  Other rules apply.  For example, only certain socket types may intercommunicate and some socket types do not work with some transports.  These rules are all general to *libzmq* (not just *cppzmq*).  It's up to us to write applications that follow these rules while *cppzmq* provides us very simple ways to form the links.

#+begin_src c++
  const std::string addr = "tcp://127.0.0.1:5678";
  sock1.bind(addr);
  sock2.connect(addr);
#+end_src

Note the lack of return values.  A ~zmq::error_t~ will be thrown if something goes wrong.  The linkage may be kept for the entire life cycle of the sockets but some applications may want to explicitly undo these actions:

#+begin_src c++
  sock1.unbind(addr);
  sock2.disconnect(addr);
#+end_src

