index.html

<div id="outline-container-orgd2509b7" class="outline-3">
<h3 id="orgd2509b7">Buffer operations</h3>
<div class="outline-text-3" id="text-orgd2509b7">
<p>
Once constructed, buffers are rather simple but we can operate on them to narrow their view of the underlying data.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Truncate tail half, same works with const_buffer</span>
mbuf = <span style="color: #e9b2e3;">zmq</span>::buffer(mbuf, mbuf.size()/2);
<span style="color: #73d216;">// </span><span style="color: #73d216;">Truncate front half, etc cbuf.</span>
mbuf += mbuf.size()/2;
</pre>
</div>

<p>
Why do this narrowing?  One very useful pattern is for an application to take some action based on the prefix or postfix of a message.  This narrowing can be performed after this information is used and the remainder can be forwarded to an output socket.  No copying needed.
</p>
</div>
</div>

<div id="outline-container-orgea466aa" class="outline-3">
<h3 id="orgea466aa">Access buffer data</h3>
<div class="outline-text-3" id="text-orgea466aa">
<p>
Unlike a message, a buffer has only a basic pair of methods to get back the original data and its size, reflecting any narrowing that occurred.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">void</span> *<span style="color: #fcaf3e;">vptr</span> = mbuf.data();
<span style="color: #8cc4ff;">size_t</span> <span style="color: #fcaf3e;">size</span> = mbuf.size();
</pre>
</div>

<p>
And, that's about it.
</p>
</div>
</div>
</div>

<div id="outline-container-org4f10d1c" class="outline-2">
<h2 id="context">Context</h2>
<div class="outline-text-2" id="text-context">
<p>
The <code>context_t</code> from <code>zmq.hpp</code> embodies an opaque <b>libzmq</b> context such as created by <a href="http://api.zeromq.org/master:zmq_ctx_new"><code>zmq_ctx_new(3)</code></a>.  A context is used by ZeroMQ to collect and manage a set of sockets which the application creates on/in the context.  The context is thread safe (unlike some sockets) and may be shared between threads without concern for locking at the application level.  
</p>
</div>

<div id="outline-container-orgec4d119" class="outline-3">
<h3 id="create-context">Creating a context</h3>
<div class="outline-text-3" id="text-create-context">
<p>
Almost always we create the default context:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">context_t</span> <span style="color: #fcaf3e;">ctx</span>;
</pre>
</div>

<p>
A move constructor is also available.  After construction, various context options may be set and queried and <b>cppzmq</b> provides <code>ctx.set()</code> and <code>ctx.get()</code> to do this.  I have yet to use them but we may check <a href="http://api.zeromq.org/master:zmq_ctx_set"><code>zmq_ctx_set(3)</code></a> for anything interesting.
</p>
</div>
</div>

<div id="outline-container-org4990bda" class="outline-3">
<h3 id="context-life">Context life cycle</h3>
<div class="outline-text-3" id="text-context-life">
<p>
We can not copy a context but we can move.   Typically, we will construct it, keep it alive as long as we need the sockets that we have created with it and if we need it in some other code context we may pass it by reference.  Here is a contrived example.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">run_app</span>(<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">context_t</span>&amp; <span style="color: #fcaf3e;">ctx</span>);

<span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">main</span>()
{
    <span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">context_t</span> <span style="color: #fcaf3e;">ctx</span>;
    run_app(ctx);
}
</pre>
</div>

<p>
In most applications, we will let the <code>context_t</code> destruct and that will tear down our sockets.  We may also tear down even sooner:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Cease any blocking operations in progress.</span>
ctx.shutdown();

<span style="color: #73d216;">// </span><span style="color: #73d216;">Do a shutdown, if needed and destroy the context.</span>
ctx.close();
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org0af45bc" class="outline-2">
<h2 id="sockets">Socket</h2>
<div class="outline-text-2" id="text-sockets">
<p>
The heart of ZeroMQ is the socket and for it <b>cppzmq</b> supplies us with the class <code>socket_t</code>.  There exists too much useful information on the intriguing variety of ZeroMQ sockets to repeat here.  A concise and definitive source is <a href="http://api.zeromq.org/master:zmq_socket"><code>zmq_socket(3)</code></a>.  Really, read that carefully as it answers a large fraction of questions I have had and see asked by others.
</p>
</div>

<div id="outline-container-org83354c1" class="outline-3">
<h3 id="socket-life">Socket life cycle</h3>
<div class="outline-text-3" id="text-socket-life">
<p>
To be useful, sockets must be created with a <b>context</b> (which we covered in section <a href="#context">Context</a>) and a socket type identifier.  In <b>libzmq</b> the type is identified with an integer, usually as provided by a CPP macro like <code>ZMQ_PUB</code>.  In <b>cppzmq</b> (in C++11) we may still use these macros or bare integers or we may use an <code>enum class socket_type</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #b4fa70;">using</span> <span style="color: #b4fa70;">namespace</span> <span style="color: #e9b2e3;">zmq</span>;
<span style="color: #8cc4ff;">context_t</span> <span style="color: #fcaf3e;">ctx</span>;
<span style="color: #8cc4ff;">socket_t</span> <span style="color: #fce94f;">pub</span>(ctx, ZMQ_PUB);
<span style="color: #8cc4ff;">socket_t</span> <span style="color: #fce94f;">sub</span>(ctx, <span style="color: #e9b2e3;">socket_type</span>::sub);
</pre>
</div>

<p>
A default socket may be constructed and later swap guts with another socket through a move assignment.  A socket may also be move-constructed.  But we can not copy a socket.   
</p>

<div class="caution">
<p>
Not just for <b>cppzmq</b>, we must take care that all ZeroMQ sockets besides <b>SERVER</b>, <b>CLIENT</b>, <b>RADIO</b> and <b>DISH</b> must not be used from any thread other than the one in which they were created.  Some caveats apply but best thing is just don't do it.
</p>

</div>

<p>
When a socket destructs or if its <code>socket_t::close()</code> method is explicitly called, the underlying <b>libzmq</b> socket will be destroyed via <a href="http://api.zeromq.org/master:zmq_close"><code>zmq_close(3)</code></a>.  
</p>
</div>
</div>

<div id="outline-container-org1961142" class="outline-3">
<h3 id="socket-link">Socket linkage</h3>
<div class="outline-text-3" id="text-socket-link">
<p>
ZeroMQ sockets link up with each other via transport addresses (see eg <a href="http://api.zeromq.org/master:zmq_tcp"><code>zmq_tcp(7)</code></a>, <a href="http://api.zeromq.org/master:zmq_ipc"><code>zmq_ipc(7)</code></a>, <a href="http://api.zeromq.org/master:zmq_inproc"><code>zmq_inproc(7)</code></a>).  One or more sockets may "bind" to an address and one or more may "connect".  At least one of each type of link must be made for messages to be exchanged.  Other rules apply.  For example, only certain socket types may intercommunicate and some socket types do not work with some transports.  These rules are all general to <b>libzmq</b> (not just <b>cppzmq</b>).  It's up to us to write applications that follow these rules while <b>cppzmq</b> provides us very simple ways to form the links.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #b4fa70;">const</span> <span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string</span> <span style="color: #fcaf3e;">addr</span> = <span style="color: #e9b96e;">"tcp://127.0.0.1:5678"</span>;
sock1.bind(addr);
sock2.connect(addr);
</pre>
</div>

<p>
Note the lack of return values.  A <code>zmq::error_t</code> will be thrown if something goes wrong.  The linkage may be kept for the entire life cycle of the sockets but some applications may want to explicitly undo these actions:
</p>

<div class="org-src-container">
<pre class="src src-c++">sock1.unbind(addr);
sock2.disconnect(addr);
</pre>
</div>
</div>
</div>
