index.org
** Sending

We have several ways to send with *cppzmq* and several more which are deprecated.  Here, let's focus on the preferred methods.  The choice is to pass a ~message_t~ by lvalue reference or by rvalue reference or to pass a ~const_buffer~ by value  In all cases we must also provide something called "send flags" which we will cover in a little bit

#+begin_src c++
  zmq::message_t msg = ...;

  // Pass by reference
  auto res = sock.send(msg, zmq::send_flags::none);

  // Pass by move
  auto res = sock.send(std::move(msg), zmq::send_flags::none);

  // Pass by buffer
  auto res = sock.send(zmq::str_buffer("hello world"), zmq::send_flags::none);
#+end_src

The first two call {{{zman(zmq_msg_send,3)}}} and the last calls {{{zman(msg_send,3)}}} so see those man pages for any nitty gritty details you may want.

*** Send flags

ZeroMQ accepts a few "hints" on how it is to treat a message when sending.  In *cppzmq* we may provide these with the ~enum class~ called ~zmq::send_flags~.  It is rare that I use anything other than ~zmq::send_flags::none~, as shown in the example, but two more are available:

- ~dontwait~ :: if the send may block instead return immediately with error *EAGAIN*
- ~sndmore~ :: the message is to be sent together with a following message

Details of the applicability and meaning of these flags are found in {{{zman(zmq_msg_send,3)}}}.  

*** Send results

That ~auto res~ holding the return of a ~send()~ in the example above is a ~zmq::send_result_t~ and that is a ~std::optional~ which may hold a ~size_t~ giving the number of bytes sent or nothing if *EAGAIN* error occurred and that only happens with a ~dontwait~ flag (see above).

Regardless of the send flag used we *must* save the send result in a variable because the ~send()~ methods are compiled marked with the C++ attribute ~[[nodiscard]]~.  We can be lazy and then do nothing with the ~res~ variable, but we should be more rigorous and compile with ~-Wunused~ (maybe via ~-Wall~) so we can be told when we fail to use the ~res~ send result.  Let's be even better and compile with ~-Werror~ to really force us to do something with it.

Regardless of what send flag we use, any other error that occurs will lead to a throw of the ~zmq::error_t~ exception so we do not require any special compiler flags to be sure all other errors can not go silently unchecked.

#+begin_note
One comment to give my preference.  In most cases we will use ~none~.  The API would be friendlier to us if ~none~ was set as a default.  However, that simpler call signature was already taken by other (now deprecated) versions of ~send()~.  Maybe in a future release, at the cost of a breaking change, this friendliness can be added!
#+end_note

*** Send polling

At times our application may send messages faster than downstream applications can receive.  Eventually, our socket's internal buffer will reach its "high water mark" (HWM) and enter what is called the "mute" state.  What happens next depends on the socket types used and is explained in nice detail in {{{zman(zmq_socket,3)}}}.  We may elect to let that built-in behavior handle the issue or we may develop our application to be more proactive.  For that, we can learn if the next message will tip our socket into "mute" step by polling it prior to output (pollout).  A pollout is maybe not so commonly used compared to its opposite (pollin) which we will touch on in the next section and we will revisit polling in more detail in section [[Poller]].

** Receiving

The opposite to sending to a socket is receiving from a socket.  We may do this with ~recv()~.  The misspelling of this verb has a long history in network programming and ZeroMQ and *cppzmq* cheerfully continues it.  Like with ~send()~, we have one ~recv()~ method for a message, one for a buffer, and for both we give recv flags.  

#+begin_src c++
// Fill a message passed by reference
auto res = sock.recv(msg, zmq::recv_flags::none);

// Fill a suitably pre-sized mutable_buffer
auto res = sock.recv(buf, zmq::recv_flags::none);
#+end_src

These two examples correspond to the low-level {{{zman(zmq_msg_recv,3)}}} and {{{zman(zmq_recv,3)}}} respectively.  When using the buffer to receive the data, take care that it has sufficient capacity to hold the expected message.  The care you must take pays back in avoiding a copy.

*** Receive flags

Like ~send()~, ~recv()~ takes flags but with this method we may often want to specify a flag besides ~none~.  There is however only one other choice:

- ~dontwait~ :: if the recv may block instead return immediately with error *EAGAIN*

This flag can be useful if our application wants to do a "quick check" to see if a message is waiting, and to receive it.  If no message is sitting in the socket's input queue, the ~recv()~ will return immediately.  If we use ~none~ then ~recv()~ may, in principle, wait until the end of the universe before returning.  

*** Receive results

Also like ~send()~, our ~recv()~ returns a ~std::optional~ result which is empty if *EAGAIN* was returned by *libzmq*.  Otherwise it returns the number of bytes received.   And likewise, this return value also must be saved to a variable.  The same comments about the importance to check this value as described in the [[Send results]] section apply here.  

When we ~recv()~ with ~message_t~, a non-empty receive result will hold the size in bytes of the message.  
OTOH, when using a buffer, it is extra important to check the receive result.  If non-empty it holds a ~zmq::recv_buffer_size~ which is a little ~struct~ holding two size attributes.  The ~size~ says how much data we received and the ~untruncated_size~ tells us how much data ZeroMQ wanted to give us.  If the two values differ we know our application failed to provide a large enough buffer.  Oops.

