index.html

<div id="outline-container-org3e50177" class="outline-3">
<h3 id="org3e50177">Sending</h3>
<div class="outline-text-3" id="text-org3e50177">
<p>
We have several ways to send with <b>cppzmq</b> and several more which are deprecated.  Here, let's focus on the preferred methods.  The choice is to pass a <code>message_t</code> by lvalue reference or by rvalue reference or to pass a <code>const_buffer</code> by value  In all cases we must also provide something called "send flags" which we will cover in a little bit
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span> = <span style="color: #fce94f;">...</span>;

<span style="color: #73d216;">// </span><span style="color: #73d216;">Pass by reference</span>
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.send(msg, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::none);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Pass by move</span>
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.send(<span style="color: #e9b2e3;">std</span>::move(msg), <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::none);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Pass by buffer</span>
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.send(<span style="color: #e9b2e3;">zmq</span>::str_buffer(<span style="color: #e9b96e;">"hello world"</span>), <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::none);
</pre>
</div>

<p>
The first two call <a href="http://api.zeromq.org/master:zmq_msg_send"><code>zmq_msg_send(3)</code></a> and the last calls <a href="http://api.zeromq.org/master:msg_send"><code>msg_send(3)</code></a> so see those man pages for any nitty gritty details you may want.
</p>
</div>

<div id="outline-container-orgfc7301b" class="outline-4">
<h4 id="orgfc7301b">Send flags</h4>
<div class="outline-text-4" id="text-orgfc7301b">
<p>
ZeroMQ accepts a few "hints" on how it is to treat a message when sending.  In <b>cppzmq</b> we may provide these with the <code>enum class</code> called <code>zmq::send_flags</code>.  It is rare that I use anything other than <code>zmq::send_flags::none</code>, as shown in the example, but two more are available:
</p>

<dl class="org-dl">
<dt><code>dontwait</code></dt><dd>if the send may block instead return immediately with error <b>EAGAIN</b></dd>
<dt><code>sndmore</code></dt><dd>the message is to be sent together with a following message</dd>
</dl>

<p>
Details of the applicability and meaning of these flags are found in <a href="http://api.zeromq.org/master:zmq_msg_send"><code>zmq_msg_send(3)</code></a>.  
</p>
</div>
</div>

<div id="outline-container-org701f951" class="outline-4">
<h4 id="org701f951">Send results</h4>
<div class="outline-text-4" id="text-org701f951">
<p>
That <code>auto res</code> holding the return of a <code>send()</code> in the example above is a <code>zmq::send_result_t</code> and that is a <code>std::optional</code> which may hold a <code>size_t</code> giving the number of bytes sent or nothing if <b>EAGAIN</b> error occurred and that only happens with a <code>dontwait</code> flag (see above).
</p>

<p>
Regardless of the send flag used we <b>must</b> save the send result in a variable because the <code>send()</code> methods are compiled marked with the C++ attribute <code>[[nodiscard]]</code>.  We can be lazy and then do nothing with the <code>res</code> variable, but we should be more rigorous and compile with <code>-Wunused</code> (maybe via <code>-Wall</code>) so we can be told when we fail to use the <code>res</code> send result.  Let's be even better and compile with <code>-Werror</code> to really force us to do something with it.
</p>

<p>
Regardless of what send flag we use, any other error that occurs will lead to a throw of the <code>zmq::error_t</code> exception so we do not require any special compiler flags to be sure all other errors can not go silently unchecked.
</p>

<div class="note">
<p>
One comment to give my preference.  In most cases we will use <code>none</code>.  The API would be friendlier to us if <code>none</code> was set as a default.  However, that simpler call signature was already taken by other (now deprecated) versions of <code>send()</code>.  Maybe in a future release, at the cost of a breaking change, this friendliness can be added!
</p>

</div>
</div>
</div>

<div id="outline-container-orgbdd567f" class="outline-4">
<h4 id="orgbdd567f">Send polling</h4>
<div class="outline-text-4" id="text-orgbdd567f">
<p>
At times our application may send messages faster than downstream applications can receive.  Eventually, our socket's internal buffer will reach its "high water mark" (HWM) and enter what is called the "mute" state.  What happens next depends on the socket types used and is explained in nice detail in <a href="http://api.zeromq.org/master:zmq_socket"><code>zmq_socket(3)</code></a>.  We may elect to let that built-in behavior handle the issue or we may develop our application to be more proactive.  For that, we can learn if the next message will tip our socket into "mute" step by polling it prior to output (pollout).  A pollout is maybe not so commonly used compared to its opposite (pollin) which we will touch on in the next section and we will revisit polling in more detail in section <a href="#poller">Poller</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org3a79e67" class="outline-3">
<h3 id="org3a79e67">Receiving</h3>
<div class="outline-text-3" id="text-org3a79e67">
<p>
The opposite to sending to a socket is receiving from a socket.  We may do this with <code>recv()</code>.  The misspelling of this verb has a long history in network programming and ZeroMQ and <b>cppzmq</b> cheerfully continues it.  Like with <code>send()</code>, we have one <code>recv()</code> method for a message one for a buffer and for both we give recv flags.  
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Fill a message passed by reference</span>
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.recv(msg, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">recv_flags</span>::none);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Fill a suitably pre-sized mutable_buffer</span>
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.recv(buf, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">recv_flags</span>::none);
</pre>
</div>

<p>
These two examples correspond to the low-level <a href="http://api.zeromq.org/master:zmq_msg_recv"><code>zmq_msg_recv(3)</code></a> and <a href="http://api.zeromq.org/master:zmq_recv"><code>zmq_recv(3)</code></a> respectively.  When using the buffer to receive the data, take care that it has sufficient capacity to hold the expected message.  The care you must take pays back in avoiding a copy.
</p>
</div>

<div id="outline-container-org95415bf" class="outline-4">
<h4 id="org95415bf">Receive flags</h4>
<div class="outline-text-4" id="text-org95415bf">
<p>
Like <code>send()</code>, <code>recv()</code> takes flags but with this method we may often want to specify a flag besides <code>none</code>.  There is however only one other choice:
</p>

<dl class="org-dl">
<dt><code>dontwait</code></dt><dd>if the recv may block instead return immediately with error <b>EAGAIN</b></dd>
</dl>

<p>
This flag can be useful if our application wants to do a "quick check" to see if a message is waiting, and to receive it.  If no message is sitting in the socket's input queue, the <code>recv()</code> will return immediately.  If we use <code>none</code> then <code>recv()</code> may, in principle, wait until the end of the universe before returning.  
</p>
</div>
</div>

<div id="outline-container-org4791db8" class="outline-4">
<h4 id="org4791db8">Receive results</h4>
<div class="outline-text-4" id="text-org4791db8">
<p>
Also like <code>send()</code>, our <code>recv()</code> returns a <code>std::optional</code> result which is empty if <b>EAGAIN</b> was returned by <b>libzmq</b>.  Otherwise it returns the number of bytes received.   And likewise, this return value also must be saved to a variable.  The same comments about the importance to check this value as describe in the <a href="#org701f951">Send results</a> section apply here.  
</p>

<p>
When we <code>recv()</code> with <code>message_t</code>, a non-empty receive result will hold the size in bytes of the message.  
OTOH, when using a buffer, it is extra important to check the receive result.  If non-empty it holds a <code>zmq::recv_buffer_size</code> which is a little <code>struct</code> holding two size attributes.  The <code>size</code> says how much data we received and the <code>untruncated_size</code> tells us how much data ZeroMQ wanted to give us.  If the two values differ we know our application failed to provide a large enough buffer.  Oops.
</p>
</div>
</div>
