index.org
*** Receive polling

Depending on the receive flags we can either assure an immediate return from ~recv()~ or we may risk it never returning.  That's a tough dichotomy to live with.  Thankfully we can assure that the call waits at most some time in between those extremes using receive polling.  This is discussed more below in the section [[Poller]].

** Socket options

Usually we develop an application that makes some ZeroMQ sockets, do our ~bind()/connect()~ and some ~send()/recv()~ and that's all we need for a lot of fun.  There's not much detail to worry about.  Sometimes we have a tough problem that needs something special and there's very likely a way that past ZeroMQ community members have found a solution.  We then just need to find and set the right socket options.

The rather long list of possible options (85 counted today) are given in {{{zman(zmq_setsockopt,3)}}}.  There they have names like ~ZMQ_IMMEDIATE~ or ~ZMQ_ROUTING_ID~ which are CPP macros expanding to some integer.  For each, *cppzmq* creates a type tag to use with friendly ~get()/set()~ methods on ~socket_t~.

#+begin_src c++
  sock.set(zmq::sockopt::immediate, false);
  sock.set(zmq::sockopt::routing_id, "me");
  auto rid = sock.get(zmq::sockopt::routing_id);
#+end_src

We will still need to carefully read ~zmq_setsockopt~ to discover and understand what options may help us, but then applying or querying them with a *cppzmq* socket is simple.

** Socket properties

One special socket option lets us set socket properties.  These can be retrieved from messages that pass through the socket as described above in [[Message metadata]].   

#+begin_src c++
  sock.set(zmq::sockopt::metadata, zmq::str_buffer("X-color:purple"));
  auto res = sock.recv(msg, zmq::recv_flags::none);
  std::string val = msg.gets("X-color");
  assert(val == "purple");
#+end_src

** Socket references

Sockets in *cppzmq* cannot be copied (they can be moved), while it is usual that we want various parts of our application code to share access to the same socket.  We can pass around an lvalue reference to our socket but that is not always possible or convenient.

To help with this, we are given a ~zmq::socket_ref~ which refers to but does not own a socket.  With a socket ref our code can do almost everything it would do with a full socket object and it can know if the underlying socket has been closed.

#+begin_src c++
  zmq::socket_t sock(ctx, zmq::socket_type::pub);
  zmq::socket_ref sref = sock;
  
  // pass ref by value (copy)
  do_some_socket_stuff(sref);

  // Check if our socket is still there
  if (sref == nullptr) {
      respond_to_closure();
  }
  
  // Do stuff with collections of socket refs
  std::unordered_set<zmq::socket_ref> bag_of_socks;
  bag_of_socks.insert(sref);
  for (auto s : bag_of_socks) {
      auto res = s.send(bcast, zmq::send_flags::none);
  }
#+end_src

** Socket handle

Our nice *cppzmq* socket is a facade over an opaque socket object from *libzmq*.  Rarely do we care about that but there may be cases where we do.  For example, if we want to directly call some *libzmq* function or maybe inter-operate with CZMQ code, we can do so by getting the underlying *libzmq* socket. 

#+begin_src c++
  zmq::socket_t sock = ...;
  void* libzmq_socket = sock.handle();
  // use libzmq to bind.  We would probably never do this as we'd prefer
  // to use sock.bind(), but it shows the possibility.
  int port = zmq_bind(libzmq_socket, "tcp://*:*");

  // Use a CZMQ socket.  We might do something this if we use nice CZMQ
  // CLASS like Zyre!
  zsock_t czmq_socket = zsock_new_pub("tcp://*:*");
  zmq::socket_ref sock(zmq::from_handle, zsock_resolve(czmq_socket));
#+end_src

Most of the time, let's ignore we have a "handle" on the *libzmq* socket and rest assured that if we ever need it, it will be there.

