index.html

<div id="outline-container-orgecf2b00" class="outline-4">
<h4 id="orgecf2b00">Receive polling</h4>
<div class="outline-text-4" id="text-orgecf2b00">
<p>
Depending on the receive flags we can either assure an immediate return from <code>recv()</code> or we may risk it never returning.  That's a tough dichotomy to live with.  Thankfully we can assure that the call waits at most some time in between those extremes using receive polling.  This is discussed more below in the section <a href="#poller">Poller</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd077f1e" class="outline-3">
<h3 id="orgd077f1e">Socket options</h3>
<div class="outline-text-3" id="text-orgd077f1e">
<p>
Usually we develop an application that makes some ZeroMQ sockets, do our <code>bind()/connect()</code> and some <code>send()/recv()</code> and that's all we need for a lot of fun.  There's not much detail to worry about.  Sometimes we have a tough problem that needs something special and there's very likely a way that past ZeroMQ community members have found a solution.  We then just need to find and set the right socket options.
</p>

<p>
The rather long list of possible options (85 counted today) are given in <a href="http://api.zeromq.org/master:zmq_setsockopt"><code>zmq_setsockopt(3)</code></a>.  There they have names like <code>ZMQ_IMMEDIATE</code> or <code>ZMQ_ROUTING_ID</code> which are CPP macros expanding to some integer.  For each, <b>cppzmq</b> creates a type tag to use with friendly <code>get()/set()</code> methods on <code>socket_t</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++">sock.set(<span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">sockopt</span>::immediate, <span style="color: #e9b2e3;">false</span>);
sock.set(<span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">sockopt</span>::routing_id, <span style="color: #e9b96e;">"me"</span>);
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">rid</span> = sock.get(<span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">sockopt</span>::routing_id);
</pre>
</div>

<p>
We will still need to carefully read <code>zmq_setsockopt</code> to discover and understand what options may help us, but then applying or querying them with a <b>cppzmq</b> socket is simple.
</p>
</div>
</div>

<div id="outline-container-org955cdae" class="outline-3">
<h3 id="org955cdae">Socket properties</h3>
<div class="outline-text-3" id="text-org955cdae">
<p>
One special socket option lets us set socket properties.  These can be retrieved from messages that pass through the socket as described above in <a href="#message-metadata">Message metadata</a>.   
</p>

<div class="org-src-container">
<pre class="src src-c++">sock.set(<span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">sockopt</span>::metadata, <span style="color: #e9b2e3;">zmq</span>::str_buffer(<span style="color: #e9b96e;">"X-color:purple"</span>);
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.recv(msg, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">recv_flags</span>::none);
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string</span> <span style="color: #fcaf3e;">val</span> = msg.gets(<span style="color: #e9b96e;">"X-color"</span>);
assert(val == <span style="color: #e9b96e;">"purple"</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orga25afc6" class="outline-3">
<h3 id="orga25afc6">Socket references</h3>
<div class="outline-text-3" id="text-orga25afc6">
<p>
Sockets in <b>cppzmq</b> can not be copied (they can be moved) while it is usual that we want various parts of our application code to share access to the same socket.  We can pass around an lvalue reference to our socket but that is not always possible or convenient.
</p>

<p>
To help with this, we are given a <code>zmq::socket_ref</code> which refers to but does not own a socket.  With a socket ref our code can do almost everything it would do with a full socket object and it can know if the underlying socket has been closed.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">socket_t</span> <span style="color: #fce94f;">sock</span>(ctx, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">socket_type</span>::pub);
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">socket_ref</span> <span style="color: #fcaf3e;">sref</span> = sock;

<span style="color: #73d216;">// </span><span style="color: #73d216;">pass ref by value (copy)</span>
do_some_socket_stuff(sref);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Check if our socket is still there</span>
<span style="color: #b4fa70;">if</span> (sref == <span style="color: #e9b2e3;">nullptr</span>) {
    respond_to_closure();
}

<span style="color: #73d216;">// </span><span style="color: #73d216;">Do stuff with collections of socket refs</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">unordered_set</span>&lt;<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">socket_ref</span>&gt; <span style="color: #fcaf3e;">bag_of_socks</span>;
bag_of_socks.insert(sref);
<span style="color: #b4fa70;">for</span> (<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">s</span> : bag_of_socks) {
    <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = s.send(bcast, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::none);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0e439b" class="outline-3">
<h3 id="orga0e439b">Socket handle</h3>
<div class="outline-text-3" id="text-orga0e439b">
<p>
Our nice <b>cppzmq</b> socket is a facade over an opaque socket object from <b>libzmq</b>.  Rarely do we care about that but there may be cases where we do.  For example, if we want to directly call some <b>libzmq</b> function or maybe inter-operate with CZMQ code, we can do so by getting the underlying <b>libzmq</b> socket. 
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">socket_t</span> <span style="color: #fcaf3e;">sock</span> = <span style="color: #fce94f;">...</span>;
<span style="color: #8cc4ff;">void</span>* <span style="color: #fcaf3e;">libzmq_socket</span> = sock.handle();
<span style="color: #73d216;">// </span><span style="color: #73d216;">use libzmq to bind.  We would probably never do this as we'd prefer</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">to use sock.bind(), but it shows the possibility.</span>
<span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">port</span> = zmq_bind(libzmq_socket, <span style="color: #e9b96e;">"tcp://*:*"</span>);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Use a CZMQ socket.  We might do something this if we use nice CZMQ</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">CLASS like Zyre!</span>
<span style="color: #8cc4ff;">zsock_t</span> <span style="color: #fcaf3e;">czmq_socket</span> = zsock_new_pub(<span style="color: #e9b96e;">"tcp://*:*"</span>);
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">socket_ref</span> <span style="color: #fce94f;">sock</span>(<span style="color: #e9b2e3;">zmq</span>::from_handle, <span style="color: #8cc4ff;">zsock_resolve</span>(<span style="color: #fcaf3e;">czmq_socket</span>));
</pre>
</div>

<p>
Most of the time, let's ignore we have a "handle" on the <b>libzmq</b> socket and rest assured that if we ever need it, it will be there.
</p>
</div>
</div>
</div>
