index.org
* Monitor
  :PROPERTIES:
  :CUSTOM_ID: monitor
  :END:

ZeroMQ gives us great power and all it asks is that we stay out of its way.  To nag ZeroMQ to tell us every detail about its internal operation is also to slow it down and impede its job.  We strive then to relax and use ZeroMQ sockets as they are intended, a sink or a source of messages to and from the cosmos.

However, and zen platitudes aside, sometimes we must get uptight and worry about what our trusty ZeroMQ friend is busy doing.  For that, *cppzmq* provides us a socket monitor, spelled ~zmq::monitor_t~.

The way for our application to make use of a ~monitor_t~ is to subclass it and implement some of the many ~monitor_t:on_event_*()~ virtual methods.  Each such method corresponds to one of the event types listed in {{{zman(zmq_socket_monitor,3)}}}.  We may also limit the events that our monitor reacts to by giving it a list of events as a bitmap.

#+begin_src c++
  class connect_monitor_t : public zmq::monitor_t {
  public:
      void on_event_connected(const zmq_event_t& event,
                              const char* addr) override
      {
          std::cout << "got connection from " << addr << std::endl;
      }    
  };

  // elsewhere
  zmq::socket_t sock = ...;
  const int events = ZMQ_EVENT_CONNECTED;
  // Monitor sock using the given transport for internal communication
  connect_monitor_t mon(sock, "inproc://conmon", events);
  // mon runs forever....

  // Now, try it a different way:
  connect_monitor_t mon2;
  // here, default is ZMQ_EVENT_ALL
  mon2.init(sock, "inproc://conmon2");
  // init returns and we poll when we want
  if (! mon2.check_event(100)) {
      std::cout << "timeout" << std::endl;
  }
#+end_src

In this example, the construction of ~mon~ with arguments tells it to run forever.  This might make the rest of the code in our application jealous so it would have been better were we to put it running in its own thread.  For ~mon2~ we default construct and then after an explicit ~init()~ we may check for any activity with a timeout.  In this case we ask for all events but since our ~connect_monitor_t~ implements but one callback, all the other events result in silent no-op calls to the base class ~on_event_*()~ methods.

#+begin_note

There is no queue monitoring.

I have seen people asking how to monitor the number of messages waiting in the input or output queue of a socket.  I've sometimes thought I absolutely needed this information myself.  However, this information is not available for monitoring.

I have come to understand this choice is due to a few reasons.  First, to provide these values would require additional processing which would degrade the performance of ZeroMQ.  Second, by the time the application gets the answer the value has long gone stale, particularly in the case of a high message rates.  Third, there is not much use in an application knowing this information in the first place because if the socket is not in mute state then all is well, if it is in mute, the application can tell in ways described above and more next in section [[Poller]].   Fourth, there is no fourth.

In understanding my own motives to ask for this and trying to understand others', I conclude the design choice is correct and the requests are really uncovering examples of the [[https://en.wikipedia.org/wiki/XY_problem][X-Y problem]].  There's really some problem and we think peeking under ZeroMQ's skirts will solve it, but the real problem may be something else and there are other solutions.

But, if one tosses aside these words as absurd ramblings, then we may always bolt on some application-managed message queues, eg as simple ~std::deque~.  We may then feed a ~send()~ and drain a ~recv()~ as fast as possible and monitor the ~.size()~ of our application-level queues.  If there is concern that ~.size()~ doesn't count what ZeroMQ holds we may set the socket HWM to, say a value of 1.  If you follow this approach, please benchmark throughput, latency and memory usage with and without application buffers and let me know the results.
#+end_note

* Poller
  :PROPERTIES:
  :CUSTOM_ID: poller
  :END:

In several places above we have alluded to something called polling.  It was even used, if maybe not noticed, in the example in the [[Monitor]] section when we call ~check_event(100)~.  This call takes at most 100 milliseconds to return.  If an event is waiting or arrives within that timeout, it will return even sooner.  Had we used a timeout of -1 the method will never return if no new monitored events were raised.

This act of waiting for an event with a finite or infinite timeout is generally termed /polling/.  Most often, as with ~check_event()~ we poll for the event that a message is ready to ~recv()~.  This is called *pollin* ("poll in") or in *libzmq* spelling ~ZMQ_POLLIN~.  Less common, but important for robust applications is to poll for the ability to send.  This is called *pollout* or ~ZMQ_POLLOUT~.

A "poller" then helps application code to respond to a successful poll or to know that instead the poll timed out.  In *cppzmq* we have the ~zmq::poller_t~ in ~zmq.hpp~ and the ~active_poller_t~ from ~zmq_addon.hpp~.  

