index.html

<div id="outline-container-org5d02ebd" class="outline-2">
<h2 id="monitor">Monitor</h2>
<div class="outline-text-2" id="text-monitor">
<p>
ZeroMQ gives us great power and all it asks is that we stay out of its way.  To nag ZeroMQ to tell us every detail about its internal operation is also to slow it down and impede its job.  We strive then to relax and use ZeroMQ sockets as they are intended, a sink or a source of messages to and from the cosmos.
</p>

<p>
However, and zen platitudes aside, sometimes we must get uptight and worry about what our trusty ZeroMQ friend is busy doing.  For that, <b>cppzmq</b> provides us a socket monitor, spelled <code>zmq::monitor_t</code>.
</p>

<p>
The way for our application to make use of a <code>monitor_t</code> is to subclass it and implement some of the many <code>monitor_t:on_event_*()</code> virtual methods.  Each such method corresponds to one of the event types listed in <a href="http://api.zeromq.org/master:zmq_socket_monitor"><code>zmq_socket_monitor(3)</code></a>.  We may also limit the events that our monitor reacts to by giving it a list of events as a bitmap.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">connect_monitor_t</span> : <span style="color: #b4fa70;">public</span> <span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">monitor_t</span> {
<span style="color: #b4fa70;">public</span>:
    <span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">on_event_connected</span>(<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">zmq_event_t</span>&amp; <span style="color: #fcaf3e;">event</span>,
                            <span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">char</span>* <span style="color: #fcaf3e;">addr</span>) <span style="color: #b4fa70;">override</span>
    {
        <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"got connection from "</span> &lt;&lt; addr &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
    }    
};

<span style="color: #73d216;">// </span><span style="color: #73d216;">elsewhere</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">socket_t</span> <span style="color: #fcaf3e;">sock</span> = <span style="color: #fce94f;">...</span>;
<span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">events</span> = ZMQ_EVENT_CONNECTED;
<span style="color: #73d216;">// </span><span style="color: #73d216;">Monitor sock using the given transport for internal communication</span>
<span style="color: #8cc4ff;">connect_monitor_t</span> <span style="color: #fcaf3e;">mon</span>(sock, <span style="color: #e9b96e;">"inproc://conmon"</span>, events);
<span style="color: #73d216;">// </span><span style="color: #73d216;">mon runs forever....</span>

<span style="color: #73d216;">// </span><span style="color: #73d216;">Now, try it a different way:</span>
<span style="color: #8cc4ff;">connect_monitor_t</span> <span style="color: #fcaf3e;">mon2</span>;
<span style="color: #73d216;">// </span><span style="color: #73d216;">here, default is ZMQ_EVENT_ALL</span>
mon2.init(sock, <span style="color: #e9b96e;">"inproc://conmon2"</span>);
<span style="color: #73d216;">// </span><span style="color: #73d216;">init returns and we poll when we want</span>
<span style="color: #b4fa70;">if</span> (! mon2.check_event(100)) {
    <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"timeout"</span> &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
}
</pre>
</div>

<p>
In this example, the construction of <code>mon</code> with arguments tells it to run forever.  This might make the rest of the code in our application jealous so it would have been better were we to put it running in its own thread.  For <code>mon2</code> we default construct and then after an explicit <code>init()</code> we may check for any activity with a timeout.  In this case we ask for all events but since our <code>connect_monitor_t</code> implements but one callback, all the other events result in silent no-op calls to the base class <code>on_event_*()</code> methods.
</p>

<div class="note">
<p>

</p>

<p>
There is no queue monitoring.
</p>

<p>
I have seen people asking how to monitor the number of messages waiting in the input or output queue of a socket.  I've sometimes thought I absolutely needed this information myself.  However, this information is not available for monitoring.
</p>

<p>
I have come to understand this choice is due to a few reasons.  First, to provide these values would require additional processing which would degrade the performance of ZeroMQ.  Second, by the time the application gets the answer the value has long gone stale, particularly in the case of a high message rates.  Third, there is not much use in an application knowing this information in the first place because if the socket is not in mute state then all is well, if it is in mute, the application can tell in ways described above and more next in section <a href="#poller">Poller</a>.   Forth, there is no forth.
</p>

<p>
In understanding my own motives to ask for this and trying to understand others, I conclude the design choice is correct and the requests are really uncovering examples of the <a href="https://en.wikipedia.org/wiki/XY_problem">X-Y problem</a>.  There's really some problem and we think peaking under ZeroMQ's skirts will solve it, but the real problem may be something else and there are other solutions.
</p>

<p>
But, if one tosses aside these words as absurd ramblings, then we may always bolt on some application-managed message queues, eg as simple <code>std::deque</code>.  We may then feed a <code>send()</code> and drain a <code>recv()</code> as fast as possible and monitor the <code>.size()</code> of our application-level queues.  If there is concern that <code>.size()</code> doesn't count what ZeroMQ holds we may set the socket HWM to, say a value of 1.  If you follow this approach, please benchmark throughput, latency and memory usage with and without application buffers and let me know the results.
</p>

</div>
</div>
</div>

<div id="outline-container-org10d7f9c" class="outline-2">
<h2 id="poller">Poller</h2>
<div class="outline-text-2" id="text-poller">
<p>
In several places above we have alluded to something called polling.  It was even used, if maybe not noticed, in the example in the <a href="#monitor">Monitor</a> section when we call <code>check_event(100)</code>.  This call takes at most 100 milliseconds to return.  If an event is waiting or arrives within that timeout, it will return even sooner.  Had we used a timeout of -1 the method will never return if no new monitored events were raised.
</p>

<p>
This act of waiting for an event with a finite or infinite timeout is generally termed <i>polling</i>.  Most often, as with <code>check_event()</code> we poll for the event that a message is ready to <code>recv()</code>.  This is called <b>pollin</b> ("poll in") or in <b>libzmq</b> spelling <code>ZMQ_POLLIN</code>.  Less common, but important for robust applications is to poll for the ability to send.  This is called <b>pollout</b> or <code>ZMQ_POLLOUT</code>.
</p>

<p>
A "poller" then helps application code to respond to a successful poll or to know that instead the poll timed out.  In <b>cppzmq</b> we have the <code>zmq::poller_t</code> in <code>zmq.hpp</code> and the <code>active_poller_t</code> from <code>zmq_addon.hpp</code>.  
</p>
</div>
