index.org
** ~zmq::poller_t~

In the following example, we construct two ~poller_t~ instances, one to poll on input and one to poll on output, then add some sockets and their associated events (pollin/pollout).  We then use the pollers to wait up to a timeout.  Depending on the return value, our application reacts.  

#+begin_src c++
  // We could combine the pollers but here keep input and output polling
  // separate.
  zmq::poller_t<> in_poller, out_poller;
  // Our application has two input sockets and one output.
  in_poller.add(input_socket1, zmq::event_flags::pollout);
  in_poller.add(input_socket2, zmq::event_flags::pollout);
  out_poller.add(output_socket, zmq::event_flags::pollout);

  const std::chrono::milliseconds timeout{100};
  std::vector<zio::poller_event<>> in_events(2);
  std::vector<zio::poller_event<>> out_events(1);
  while (true) {
      const auto nin = in_poller.wait_all(in_events, timeout);
      if (!nin) {
          std::cout << "input timeout, try again" << std::endl;
          continue;
      }
      for (int ind=0; ind<nin; ++ind) {
          zmq::message_t msg;
          auto rres = in_events[ind].socket.recv(msg, zmq::recv_flags::none);

          const auto nout = out_poller.wait_all(out_events, timeout);
          if (!nout) {
              std::cout << "output timeout, freakout" << std::endl;
              abort();
          }
          auto sres = out_events[0].socket.send(msg, zmq::send_flags::none);
      }
  } 
#+end_src

#+begin_note
The code that reacts to timeouts in this example is not very good.  We will be more thoughtful in our real application.
#+end_note

*** Poller data

In the example above you notice the ~poller_t<>~ declaration.  That empty template argument list sure is curious.  We may fill it in order to associate some user data to a socket event being polled.  This user data is added along with the socket and event and is then made available in any event resulting from a poll.  Here is an example where the user data is of type ~int~.

#+begin_src c++
  using mypoller_t = zmq::poller_t<int>;
  mypoller_t poller;
  int val = 42;
  poller.add(sock, zmq::event_flags::pollin, &val);
  std::vector<mypoller_t> events(1);
  auto n = poller.wait_all(events, timeout);
  if (n) {
      assert(42 == *events[0].val);
  }
#+end_src

Each socket/event registered with ~.add()~ can have its own user data but they must all be of the same (pointer to) type.

** Interlude

So far this tour has taken us through ~zmq.hpp~ and here, right in the middle of this section, we move to ~zmq_addon.hpp~.  As noted above, this switch of files feels somewhat arbitrary to me.  Parts of ~zmq_addon.hpp~ are more "core" for my own use while parts of ~zmq.hpp~ are not so "core" to me.  So, let us not worry that we now switch our focus to a header that on the surface may sound somehow secondary.  It's in fact full of more goodies.

** ~zmq::active_poller_t~

The ~active_poller_t~ is created and filled with sockets in a similar manner as ~poller_t~.  In fact it uses a ~poller_t~ under the hood.  However, its ~add()~ method takes a third argument which is a ~std::function<void(event_flags)>~ and that function will be called when that event is seen.

This allows our application the option of structuring its response to events differently.  Instead of complexity held inside the loop, it can be placed in functions or lambdas.

#+begin_src c++
  void chirp(zmq::event_flags ef);
  zmq::active_poller_t ap;
  ap.add(sock1, zmq::event_flags::pollin, [](zmq::event_flags ef) {
    std::cout << "sock1 got " << ef << std::endl;
  });
  ap.add(sock2, zmq::event_flags::pollin, chirp);

  while (true) {
      auto n = ap.wait(timeout);
      if (n) {
          std::cout << "got " << n << " sockets hit\n";
      }
      else {
          std::cout << "timeout" << std::endl;
      }
  }
#+end_src

