index.html

<div id="outline-container-orgfa6c417" class="outline-3">
<h3 id="orgfa6c417"><code>zmq::poller_t</code></h3>
<div class="outline-text-3" id="text-orgfa6c417">
<p>
In the following example, we construct two <code>poller_t</code> instances, one to poll on input and one to poll on output add some sockets and their associated events (pollin/pollout).  We then use the pollers to wait up to a timeout.  Depending on the return, our application reacts.  
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">We could combine the pollers but here keep input and output polling</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">separate.</span>
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">poller_t</span>&lt;&gt; <span style="color: #fcaf3e;">in_poller</span>, <span style="color: #fcaf3e;">out_poller</span>;
<span style="color: #73d216;">// </span><span style="color: #73d216;">Our application has two input sockets and one output.</span>
in_poller.add(input_socket1, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">event_flags</span>::pollout);
in_poller.add(input_socket2, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">event_flags</span>::pollout);
out_poller.add(output_socket, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">event_flags</span>::pollout);

<span style="color: #b4fa70;">const</span> <span style="color: #e9b2e3;">std</span>::<span style="color: #e9b2e3;">chrono</span>::<span style="color: #8cc4ff;">milliseconds</span> <span style="color: #fcaf3e;">timeout</span>{100};
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #e9b2e3;">zio</span>::<span style="color: #8cc4ff;">poller_event</span>&lt;&gt;&gt; <span style="color: #fcaf3e;">in_events</span>(2);
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #e9b2e3;">zio</span>::<span style="color: #8cc4ff;">poller_event</span>&lt;&gt;&gt; <span style="color: #fcaf3e;">out_events</span>(1);
<span style="color: #b4fa70;">while</span> (<span style="color: #e9b2e3;">true</span>) {
    <span style="color: #b4fa70;">const</span> <span style="color: #b4fa70;">auto</span> nin = in_poller.wait_all(in_events, timeout);
    <span style="color: #b4fa70;">if</span> (!nin) {
        <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"input timeout, try again"</span> &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
        <span style="color: #b4fa70;">continue</span>;
    }
    <span style="color: #b4fa70;">for</span> (<span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">ind</span>=0; ind&lt;nin; ++ind) {
        <span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span>;
        <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">rres</span> = in_events[ind].socket.recv(msg, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">recv_flags</span>::none);

        <span style="color: #b4fa70;">const</span> <span style="color: #b4fa70;">auto</span> nout = out_poller.wait_all(out_events, timeout);
        <span style="color: #b4fa70;">if</span> (!nout) {
            <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"output timeout, freakout"</span> &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
            abort();
        }
        <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">sres</span> = out_events[0].socket.send(msg, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::none);
    }
} 
</pre>
</div>

<div class="note">
<p>
The code that reacts to timeouts in this example is very good.  We will be more thoughtful in our real application.
</p>

</div>
</div>

<div id="outline-container-org28a43d1" class="outline-4">
<h4 id="org28a43d1">Poller data</h4>
<div class="outline-text-4" id="text-org28a43d1">
<p>
In the example above you notice the <code>poller_t&lt;&gt;</code> declaration.  That empty template argument list sure is curious.  We may fill it in order to associate some user data to a socket event being polled.  This user data is added along with the socket and event and is then made available in any event resulting from a poll.  Here is an example where the user data is of type <code>int</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #b4fa70;">using</span> <span style="color: #8cc4ff;">mypoller_t</span> = <span style="color: #e9b2e3;">zmq</span>::poller_t <span style="color: #8cc4ff;">poller</span>&lt;<span style="color: #8cc4ff;">int</span>&gt;;
<span style="color: #8cc4ff;">mypoller_t</span> <span style="color: #fcaf3e;">poller</span>;
<span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">val</span> = 42;
poller.add(sock, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">event_flags</span>::pollin, &amp;val);
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #8cc4ff;">mypoller_t</span>&gt; <span style="color: #fcaf3e;">events</span>(1);
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">n</span> = poller.wait_all(events, timeout);
<span style="color: #b4fa70;">if</span> (n) {
    assert(42 == *events[0].val);
}
</pre>
</div>

<p>
Each socket/event registered with <code>.add()</code> can have its own user data but they must all be of the same (pointer to) type.
</p>
</div>
</div>
</div>

<div id="outline-container-org8705484" class="outline-3">
<h3 id="org8705484">Interlude</h3>
<div class="outline-text-3" id="text-org8705484">
<p>
So far this tour has taken us through <code>zmq.hpp</code> and here, right in the middle of this section, we move to <code>zmq_addon.hpp</code>.  As noted above, this switch of files feels somewhat arbitrary to me.  Parts of <code>zmq_addon.hpp</code> are more "core" for my own use while parts of <code>zmq.hpp</code> are not so "core" to me.  So, let us not worry that we now switch our focus to a header that on the surface may sound somehow secondary.  It's in fact full of more goodies.
</p>
</div>
</div>

<div id="outline-container-org2a8f3ae" class="outline-3">
<h3 id="org2a8f3ae"><code>zmq::active_poller_t</code></h3>
<div class="outline-text-3" id="text-org2a8f3ae">
<p>
The <code>active_poller_t</code> is created and filled with sockets in a similar manner as <code>poller_t</code>.  In fact it uses a <code>poller_t</code> under the hood.  However, its <code>add()</code> method takes a third argument which is a <code>std::function&lt;void(event_flags)&gt;</code> and that function will be called when that event is seen.
</p>

<p>
This allows our application the option of structuring its response to events differently.  Instead of complexity held inside the loop, it can be placed in functions or lambdas.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">chirp</span>(<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">event_flags</span> <span style="color: #fcaf3e;">ef</span>);
<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">active_poller_t</span> <span style="color: #fcaf3e;">ap</span>;
ap.add(sock1, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">event_flags</span>::pollin, [](<span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">event_flags</span> <span style="color: #fcaf3e;">ef</span>) {
  <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"sock1 got "</span> &lt;&lt; ef &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
});
ap.add(sock2, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">event_flags</span>::pollin, chirp);

<span style="color: #b4fa70;">while</span> (<span style="color: #e9b2e3;">true</span>) {
    <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">n</span> = ap.wait(timeout);
    <span style="color: #b4fa70;">if</span> (n) {
        <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"got "</span> &lt;&lt; n &lt;&lt; <span style="color: #e9b96e;">" sockets hit\n"</span>;
    }
    <span style="color: #b4fa70;">else</span> {
        <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"timeout"</span> &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
    }
}
</pre>
</div>
</div>
</div>
</div>
