index.org
* Multipart
  :PROPERTIES:
  :CUSTOM_ID: multipart
  :END:

When I first started to learn ZeroMQ I learned lots of interesting things and also struggled with lots of confusion.   One thing that confused me extra was /multipart messages/.  Take for example the delightful puzzle from {{{zman(zmq_msg_send,3)}}} which describes

#+begin_src c++
int zmq_msg_send (zmq_msg_t *msg, void *socket, int flags);
#+end_src

#+begin_quote
*Multi-part messages:* A 0MQ message is composed of 1 or more message parts. Each message part is an independent ~zmq_msg_t~ in its own right. 0MQ ensures atomic delivery of messages: peers shall receive either all message parts of a message or none at all. The total number of message parts is unlimited except by available memory.
#+end_quote

So, we send a ~zmq_msg_t~ which is a message, but really it's a message part and we can send many of them but really we send only one.  Okay, okay, so, it all kind of makes sense now, but at the start it was all rather confusing.

Thankfully, things are more clear and precise using *cppzmq*'s terms and objects.  Previously in this tour, we described a ~message_t~ as being of a /single part/ because it held data in a single contiguous block of memory.  We will stick to that but then describe how *cppzmq* allows us to use multiple calls to ~send()~ or ~recv()~ in order to transmit /multiple, single-part/ messages altogether.  Finally, we will describe the ~multipart_t~ object of *cppzmq* which allows us to aggregate /multiple, single-part/ ~message_t~ in useful ways and then ~send()~ or ~recv()~ them with but a single call.  Finally we describe how to send and receive multiple parts with out even any ~message_t~ at all.

** Multiple messages

ZeroMQ has the concept of "/more/".  As we send a single (single-part) message we also tell the socket, "you know what, next I'm gonna send you another message and I want you to wait until I do that and then you can transmit both of them together".  This is done with *cppzmq* like:

#+begin_src c++
  zmq::message_t msg1, msg2;
  auto res = sock.send(msg1, zmq::send_flags::sndmore);
  res = sock.send(msg2, zmq::send_flags::none);
#+end_src

That's "/more/" and of course you can have more "/more/" messages than just the first one.   The chain can continue and, as it does, ZeroMQ is collecting these messages behind the scenes, waiting for that final ~none~.  When ~none~ comes, ZeroMQ races to do its magic to assure every message in the chain is delivered to all linked sockets or none of them are.  

#+begin_note
Thus, the ~zmq_msg_send(3)~ riddle is understood.  There may be multiple (single-part) messages (by which I mean some ~zmq_msg_t~'s) that the application provides to a socket for sending.  Then, once given the go-ahead, ZeroMQ will transport all their data as a single message.
#+end_note

On the other end of the transport, ZeroMQ receives the data from these multiple "/more/" messages and presents it to the application through multiple calls to ~recv()~.   We must write our application to expect this chain of separate-but-together messages and *cppzmq* provides the help we need.

#+begin_src c++
  zmq::message_t msg1, msg2;
  auto res = sock.recv(msg1, zmq::recv_flags::none);
  if (!msg1.more()) {
      std::cout << "Oh dear, sheeps are going astray\n";
  }
  else {
      auto res = sock.recv(msg2, zmq::recv_flags::none);
  }
#+end_src

#+begin_note
This ZeroMQ concept of "more" is kind of a "micro protocol" and kind of an optimization to allow truly large messages broken up to while still transmitted in a way that their ordering is assured regardless of how many peers may be attempting to otherwise multiplex their streams.  This can be needed but it can also add unwanted complication.  ZeroMQ is still buffering these messages in memory and still transmitting them sequentially, so why not allow the application to do that packaging itself?  Well....
#+end_note

