index.html

<div id="outline-container-orgeff78a0" class="outline-2">
<h2 id="multipart">Multipart</h2>
<div class="outline-text-2" id="text-multipart">
<p>
When I first started to learn ZeroMQ I learned lots of interesting things and also struggled with lots of confusion.   One thing that confused me extra was <i>multipart messages</i>.  Take for example the delightful puzzle from <a href="http://api.zeromq.org/master:zmq_msg_send"><code>zmq_msg_send(3)</code></a> which describes
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">int</span> <span style="color: #fce94f;">zmq_msg_send</span> (<span style="color: #8cc4ff;">zmq_msg_t</span> *<span style="color: #fcaf3e;">msg</span>, <span style="color: #8cc4ff;">void</span> *<span style="color: #fcaf3e;">socket</span>, <span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">flags</span>);
</pre>
</div>

<blockquote>
<p>
<b>Multi-part messages:</b> A 0MQ message is composed of 1 or more message parts. Each message part is an independent zmq<sub>msg</sub><sub>t</sub> in its own right. 0MQ ensures atomic delivery of messages: peers shall receive either all message parts of a message or none at all. The total number of message parts is unlimited except by available memory.
</p>
</blockquote>

<p>
So, we send a <code>zmq_msg_t</code> which is a message, but really it's a message part and we can send many of them but really we send only one.  Okay, okay, so, it all kind of makes sense now, but at the start it was all rather confusing.
</p>

<p>
Thankfully, things are more clear and precise using <b>cppzmq</b>'s terms and objects.  Previously in this tour, we described a <code>message_t</code> as being of a <i>single part</i> because it held data in a single contiguous block of memory.  We will stick to that but then describe how <b>cppzmq</b> allows us to use multiple calls to <code>send()</code> or <code>recv()</code> in order to transmit <i>multiple, single-part</i> messages altogether.  Finally, we will describe the <code>multipart_t</code> object of <b>cppzmq</b> which allows us to aggregate <i>multiple, single-part</i> <code>message_t</code> in useful ways and then <code>send()</code> or <code>recv()</code> them with but a single call.  Finally we describe how to send and receive multiple parts with out even any <code>message_t</code> at all.
</p>
</div>

<div id="outline-container-orgefd4893" class="outline-3">
<h3 id="orgefd4893">Multiple messages</h3>
<div class="outline-text-3" id="text-orgefd4893">
<p>
ZeroMQ has the concept of "<i>more</i>".  As we send a single (single-part) message we also tell the socket, "you know what, next I'm gonna send you another message and I want you to wait until I do that and then you can transmit both of them together".  This is done with <b>cppzmq</b> like:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg1</span>, <span style="color: #fcaf3e;">msg2</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.send(msg1, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::sndmore);
res = sock.send(msg2, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">send_flags</span>::none);
</pre>
</div>

<p>
That's "<i>more</i>" and of course you can have more "<i>more</i>" messages than just the first one.   The chain can continue and, as it does, ZeroMQ is collecting these messages behind the scenes, waiting for that final <code>none</code>.  When <code>none</code> comes, ZeroMQ races to do its magic to assure every message in the chain is delivered to all linked sockets or none of them are.  
</p>

<div class="note">
<p>
Thus, the <code>zmq_msg_send(3)</code> riddle is understood.  There may be multiple (single-part) messages (by which I mean some <code>zmq_msg_t</code>'s) that the application provides to a socket for sending.  Then, once given the go-ahead, ZeroMQ will transport all their data as a single message.
</p>

</div>

<p>
On the other end of the transport, ZeroMQ receives the data from these multiple "<i>more</i>" messages and presents it to the application through multiple calls to <code>recv()</code>.   We must write our application to expect this chain of separate-but-together messages and <b>cppzmq</b> provides the help we need.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">zmq</span>::<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg1</span>, <span style="color: #fcaf3e;">msg2</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.recv(msg1, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">recv_flags</span>::none);
<span style="color: #b4fa70;">if</span> (!msg1.more()) {
    <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"Oh dear, sheeps are going astray\n"</span>;
}
<span style="color: #b4fa70;">else</span> {
    <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = sock.recv(msg2, <span style="color: #e9b2e3;">zmq</span>::<span style="color: #e9b2e3;">recv_flags</span>::none);
}
</pre>
</div>

<div class="note">
<p>
This ZeroMQ concept of "more" is kind of a "micro protocol" and kind of an optimization to allow truly large messages broken up to while still transmitted in a way that their ordering is assured regardless of how many peers may be attempting to otherwise multiplex their streams.  This can be needed but it can also add unwanted complication.  ZeroMQ is still buffering these messages in memory and still transmitting them sequentially, so why not allow the application to do that packaging itself?  Well&#x2026;.
</p>

</div>
</div>
</div>
