index.org
** Multipart messages

Enter ~multipart_t~.  I hesitate to call this a "message" because it's really multiple messages which are aggregated into a collection (called ~multipart_t~).  Behind the scenes a ~multipart_t::send()~ and ~::recv()~ are simply handling multiple single-part ~message_t~ objects with "/more/", as described above.  Later we will describe how this can be done without even forming a ~multipart_t~ by using code which is to send/recv sort of like what buffers are to ~message_t~.

But first ~multipart_t~, which we should think about as if it were an STL collection (and in fact it uses a ~std::deque<message_t>~ under the covers).  We can construct them in many ways.

#+begin_src c++
  zmq::multipart_t empty;
  zmq::multipart_t first_from_recv(sock);
  std::vector<int> data(1024,0);
  zmq::multipart_t first_from_data(data.data(), data.size()*sizeof(int));
  zmq::multipart_t first_from_string(std::string("hello world"));
#+end_src

As the variable names are meant to imply, these latter constructors fill in an initial element of the ~multipart_t~ container.  We can then add more ~message_t~ elements:

#+begin_src c++
  zmq::message_t msg;
  zmq::multipart_t mp, mp2;

  // Prefix and postfix concatenation. 
  mp.prepend(mp2);
  mp.append(mp2);

  // push a part in various forms to front, also "add" variants to back.
  mp.pushmem(data, size);
  mp.pushstr("hello again");
  mp.pushtyp(myobject);           // effectively a memcpy
  mp.push(msg);
  mp.push_back(msg);              // same as push, but STL spelling
#+end_src

We can also remove a message (a part):

#+begin_src c++
  // from front
  zmq::message_t msg = mp.pop();
  std::string s = mp.popstr();
  MyObject mo = mp.pop<MyObject>();

  // from back
  zmq::message_t msg = mp.remove();

  // all
  mp.clear();
#+end_src

We can query and iterate on the ~multipart_t~ in many ways:

#+begin_src c++
  zmq::message_t& first = mp.front();
  zmq::message_t& last = mp.back();
  zmq::message_t* nth = mp.peek(42);
  std::count << mp.size() << " parts:\n";
  for (auto& msg : mp) {
      std::cout << msg.size() << " bytes:\n" << std::endl;
      std::cout << msg.str() << std::endl;
  }
  if (mp.empty()) {
      std::cout << "no parts\n";
  }
  
#+end_src

Finally, getting back to /multiple single-part message/ transmission we may do:

#+begin_src c++
  // Clear and receive one or MORE message_t from a socket
  mp.recv(sock);

  // Send the one or MORE message_t parts to a socket
  mp.send(sock);
#+end_src

This happily hides all the "/more/" business from our delicate eyes. 

*** Multipart ~send()~ and ~recv()~ without ~multipart_t~

Building up a ~multipart_t~ to send and receive data that is already "multipart'ish" can require unwanted code and memory copies.  If your application already has some collection of data, why should you go to this extra trouble?  The answer is, you may not need to.

The templated ~recv_multipart()~ and ~send_multipart()~ free functions are provided.  They may be used with a ~multipart_t~ as a replacement for that classes ~send()~ and ~recv()~.  But they may work with other collections holding ~message_t~ or buffers or other types.  First some receives.

#+begin_src c++
  std::vector<message_t> msgs;
  aut res = zmq::recv_multipart(sock, std::back_inserter(msgs));

  zmq::multipart_t mp;
  aut res = zmq::recv_multipart(sock, std::back_inserter(mp));
#+end_src

And some sends.

#+begin_src c++
  std::vector<zmq::message_t> msgs;
  auto res = zmq::send_multipart(sock, msgs);

  std::vector<const_buffer> cbufs;
  auto res = zmq::send_multipart(sock, cbufs);

  std::vector<mutable_buffer> mbufs;
  auto res = zmq::send_multipart(sock, mbufs);
#+end_src

** Codec
  :PROPERTIES:
  :CUSTOM_ID: codec
  :END:

We just saw how *cppzmq* can transmit a sequence of multiple, single-part messages in the ZeroMQ "/more/" way and how the ~multipart_t~ can be used to bundle up the "/more/"'ing inside the application.  CZMQ introduced another way to handle multiple, single-part messages and that is to encode them into a single, single-part message inside the application.  

#+begin_note
A bit of nomenclature.  As was mentioned, what *cppzmq* calls a ~message_t~, CZMQ writes ~zframe_t~.  What *cppzmq* calls ~multipart_t~, CZMQ says ~zmsg_t~.  As described in {{{czman(zmsg,3)}}}, the CZMQ function  ~zmsg_encode(zmsg_t*)~ returns a ~zframe_t~.  That ~zmsg_t~ is a multi-part message.  Then back in *cppzmq* we say we can encode one of its ~multipart_t~ into one ~message_t~.  Of course, an encode is not useful without a decode and together we have a codec.
#+end_note

