index.html

<div id="outline-container-org447af4e" class="outline-3">
<h3 id="org447af4e">Multipart messages</h3>
<div class="outline-text-3" id="text-org447af4e">
<p>
Enter <code>multipart_t</code>.  I hesitate to call this a "message" because it's really multiple messages which are aggregated into a collection (called <code>multipart_t</code>).  Behind the scenes a <code>multipart_t::send()</code> and <code>::recv()</code> are simply handling multiple single-part <code>message_t</code> objects with "<i>more</i>", as described above.  Later we will describe how this can be done without even forming a <code>multipart_t</code> by using code which is to send/recv sort of like what buffers are to <code>message_t</code>.
</p>

<p>
But first <code>multipart_t</code>, which we should think about as if it were an STL collection (and in fact it uses a <code>std::deque&lt;message_t&gt;</code> under the covers).  We can construct them in many ways.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">empty</span>;
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fce94f;">first_from_recv</span>(sock);
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #8cc4ff;">int</span>&gt; <span style="color: #fcaf3e;">data</span>(1024,0);
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fce94f;">first_from_data</span>(data.data(), data.size()*<span style="color: #b4fa70;">sizeof</span>(<span style="color: #8cc4ff;">int</span>));
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fce94f;">first_from_string</span>(<span style="color: #e9b2e3;">std</span>::string(<span style="color: #e9b96e;">"hello world"</span>));
</pre>
</div>

<p>
As the variable names are meant to imply, these latter constructors fill in an initial element of the <code>multipart_t</code> container.  We can then add more <code>message_t</code> elements:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span>;
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">mp</span>, <span style="color: #fcaf3e;">mp2</span>;

<span style="color: #73d216;">// </span><span style="color: #73d216;">Prefix and postfix concatenation. </span>
mp.prepend(mp2);
mp.append(mp2);

<span style="color: #73d216;">// </span><span style="color: #73d216;">push a part in various forms to front, also "add" variants to back.</span>
mp.pushmem(data, size);
mp.pushstr(<span style="color: #e9b96e;">"hello again"</span>);
mp.pushtyp(myobject);           <span style="color: #73d216;">// </span><span style="color: #73d216;">effectively a memcpy</span>
mp.push(msg);
mp.push_back(msg);              <span style="color: #73d216;">// </span><span style="color: #73d216;">same as push, but STL spelling</span>
</pre>
</div>

<p>
We can also remove a message (a part):
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">from front</span>
<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span> = mp.pop();
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">string</span> <span style="color: #fcaf3e;">s</span> = mp.popstr();
<span style="color: #8cc4ff;">MyObject</span> <span style="color: #fcaf3e;">mo</span> = mp.pop&lt;<span style="color: #8cc4ff;">MyObject</span>&gt;();

<span style="color: #73d216;">// </span><span style="color: #73d216;">from back</span>
<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span> = mp.remove();

<span style="color: #73d216;">// </span><span style="color: #73d216;">all</span>
mp.clear();
</pre>
</div>

<p>
We can query and iterate on the <code>multipart_t</code> in many ways:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">message_t</span>&amp; <span style="color: #fcaf3e;">first</span> = mp.front();
<span style="color: #8cc4ff;">message_t</span>&amp; <span style="color: #fcaf3e;">last</span> = mp.back();
<span style="color: #8cc4ff;">message_t</span>* <span style="color: #fcaf3e;">nth</span> = mp.peek(42);
<span style="color: #e9b2e3;">std</span>::count &lt;&lt; mp.size() &lt;&lt; <span style="color: #e9b96e;">" parts:\n"</span>;
<span style="color: #b4fa70;">for</span> (<span style="color: #b4fa70;">auto</span>&amp; <span style="color: #fcaf3e;">msg</span> : mp) {
    <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; msg.size() &lt;&lt; <span style="color: #e9b96e;">" bytes:\n"</span> &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
    <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; msg.str() &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
}
<span style="color: #b4fa70;">if</span> (mp.empty()) {
    <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"no parts\n"</span>;
}

</pre>
</div>

<p>
Finally, getting back to <i>multiple single-part message</i> transmission we may do:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">Clear and receive one or MORE message_t from a socket</span>
mp.recv(sock);

<span style="color: #73d216;">// </span><span style="color: #73d216;">Send the one or MORE message_t parts to a socket</span>
mp.send(sock);
</pre>
</div>

<p>
This happily hides all the "<i>more</i>" business from our delicate eyes. 
</p>
</div>

<div id="outline-container-org5bc3b91" class="outline-4">
<h4 id="org5bc3b91">Multipart <code>send()</code> and <code>recv()</code> without <code>multipart_t</code></h4>
<div class="outline-text-4" id="text-org5bc3b91">
<p>
Building up a <code>multipart_t</code> to send and receive data that is already "multipart'ish" can require unwanted code and memory copies.  If your application already has some collection of data, why should you go to this extra trouble?  The answer is, you may not need to.
</p>

<p>
The templated <code>recv_multipart()</code> and <code>send_multipart()</code> free functions are provided.  They may be used with a <code>multipart_t</code> as a replacement for that classes <code>send()</code> and <code>recv()</code>.  But they may work with other collections holding <code>message_t</code> or buffers or other types.  First some receives.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #8cc4ff;">message_t</span>&gt; <span style="color: #fcaf3e;">msgs</span>;
<span style="color: #8cc4ff;">aut</span> <span style="color: #fcaf3e;">res</span> = recv_multipart(sock, <span style="color: #e9b2e3;">std</span>::back_inserter(msgs));

<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">mp</span>;
<span style="color: #8cc4ff;">aut</span> <span style="color: #fcaf3e;">res</span> = recv_multipart(sock, <span style="color: #e9b2e3;">std</span>::back_inserter(mp));
</pre>
</div>

<p>
And some sends.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #e9b2e3;">zmq</span>::message_t&gt; <span style="color: #fcaf3e;">msgs</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = send_multipart(sock, msgs);

<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;const_buffer&gt; <span style="color: #fcaf3e;">cbufs</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = send_multipart(sock, cbufs);

<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;mutable_buffer&gt; <span style="color: #fcaf3e;">mbufs</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">res</span> = send_multipart(sock, mbufs);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgad9823c" class="outline-3">
<h3 id="codec">Codec</h3>
<div class="outline-text-3" id="text-codec">
<p>
We just saw how <b>cppzmq</b> can transmit a sequence of multiple, single-part messages in the ZeroMQ "<i>more</i>" way and how the <code>multipart_t</code> can be used to bundle up the "<i>more</i>"'ing inside the application.  CZMQ introduced another way to handle multiple, single-part messages and that is to encode them into a single, single-part message inside the application.  
</p>

<div class="note">
<p>
A bit of nomenclature.  As was mentioned, what <b>cppzmq</b> calls a <code>message_t</code>, CZMQ writes <code>zframe_t</code>.  What <b>cppzmq</b> calls <code>multipart_t</code>, CZMQ says <code>zmsg_t</code>.  As described in <a href="http://czmq.zeromq.org/czmq4-0:zmsg"><code>zmsg(3)</code></a>, the CZMQ function  <code>zmsg_encode(zmsg_t*)</code> returns a <code>zframe_t</code>.  That <code>zmsg_t</code> is a multi-part message.  Then back in <b>cppzmq</b> we say we can encode one of its <code>multipart_t</code> into one <code>message_t</code>.  Of course, an encode is not useful without a decode and together we have a codec.
</p>

</div>
</div>
