index.org
*** Why a codec

With the nice ~multipart_t~ class methods and free functions for send/recv that were just described, why introduce a codec?  The reason is that the new thread-safe sockets such as *SERVER/CLIENT* do not support the "/more/" algorithm at all.  They send one ~message_t~ at a time  Something must be done in if application protocol requires transmitting an sequence of messages in an atomic manner.  The inspiration for this was [[https://github.com/brettviren/generaldomo][generaldomo]] which generalizes the Majordomo protocol (v1) to use *SERVER/CLIENT* as well as *ROUTER/DEALER*.

So, we must do something to squish multiple messages into single one.  A codec for this can be invented by any application but interoperability is increased if a common one is shared by various ZeroMQ bindings and so the one used in CZMQ is offered in the *cppzmq*.

#+begin_note
The CZMQ / *cppzmq* codec is rather simple but not well documented outside the source code.  Let this count as documentation until some interested person writes a [[https://rfc.zeromq.org/][ZeroMQ RFC]].  

A number of messages are input to the encoding function and for each  message its size is emitted followed by the message data.  If the message is smaller than 255 bytes, the size value is stored in a single byte.  Otherwise a literal byte value of ~0xFF~ is emitted followed by the message size as a four byte value.  

The decode works in reverse.  If the first byte is ~0xFF~ the decoder knows the next four bytes provide the message size else the first byte provides the size.  The decoder then consumes a number of bytes as given by that size and fills a ~message_t~.  This repeats until the byte stream is exhausted or a parse error is encountered.
#+end_note

*** Using the codec

Okay, enough blah blah about the codec.
There are two ways to use it.  One may call methods on ~multipart_t~ or one may use free functions in analogy to how multipart ~send()/recv()~ was described above.  First, the ~multipart_t~ methods. 

#+begin_src c++
  zmq::multipart_t mp;

  zmq::message_t msg = mp.encode();
  zmq::multipart_t mp2;
  // in place, decode+append
  mp2.decode_append(msg);

  // return constructed
  zmq::multipart_t mp3 = zmq::multipart_t::decode(msg);
#+end_src

#+begin_caution
Take care how this last one is a static class method.  You can call ~mp.decode(msg)~ and it returns a new ~multipart_t~ and does not touch the object ~mp~ used to call it.
#+end_caution

Here's the codec exercised with free functions.  They have the added flexibility to operate on buffers.

#+begin_src c++
  std::vector<zmq::message_t> msgs, msgs2;
  auto msg = zmq::encode(msgs);
  zmq::decode(msg, std::back_inserter(msgs2));

  std::vector<zmq::const_buffer> cbufs;
  auto msg = zmq::encode(cbufs);
  zmq::multipart_t mp;
  zmq::decode(msg, std::back_inserter(mp));
#+end_src


* FIN

That's it.  Go forth and make the next great ZeroMQ application in C++!
