index.html

<div id="outline-container-orgeece380" class="outline-4">
<h4 id="orgeece380">Why a codec</h4>
<div class="outline-text-4" id="text-orgeece380">
<p>
With the nice <code>multipart_t</code> class methods and free functions for send/recv that were just described, why introduce a codec?  The reason is that the new thread-safe sockets such as <b>SERVER/CLIENT</b> do not support the "<i>more</i>" algorithm at all.  They send one <code>message_t</code> at a time  Something must be done in if application protocol requires transmitting an sequence of messages in an atomic manner.  The inspiration for this was <a href="https://github.com/brettviren/generaldomo">generaldomo</a> which generalizes the Majordomo protocol (v1) to use <b>SERVER/CLIENT</b> as well as <b>ROUTER/DEALER</b>.
</p>

<p>
So, we must do something to squish multiple messages into single one.  A codec for this can be invented by any application but interoperability is increased if a common one is shared by various ZeroMQ bindings and so the one used in CZMQ is offered in the <b>cppzmq</b>.
</p>

<div class="note">
<p>
The CZMQ / <b>cppzmq</b> codec is rather simple but not well documented outside the source code.  Let this count as documentation until some interested person writes an <a href="https://rfc.zeromq.org/">ZeroMQ RFC</a>.  
</p>

<p>
A number of messages are input to the encoding function and for each  message its size is emitted followed by the message data.  If the message is smaller than 255 bytes, the size value is stored in a single byte.  Otherwise a literal byte value of <code>0xFF</code> is emitted followed by the message size as a four byte value.  
</p>

<p>
The decode works in reverse.  If the first byte is <code>0xFF</code> the decoder knows the next four bytes provide the message size else the first byte provides the size.  The decoder then consumes a number of bytes as given by that size and fills a <code>message_t</code>.  This repeats until the byte stream is exhausted or a parse error is encountered.
</p>

</div>
</div>
</div>

<div id="outline-container-orga36858e" class="outline-4">
<h4 id="orga36858e">Using the codec</h4>
<div class="outline-text-4" id="text-orga36858e">
<p>
Okay, enough blah blah about the codec.
There are two ways to use it.  One may call methods on <code>multipart_t</code> or one may use free functions in analogy to how multipart <code>send()/recv()</code> was described above.  First, the <code>multipart_t</code> methods. 
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">mp</span>;

<span style="color: #8cc4ff;">message_t</span> <span style="color: #fcaf3e;">msg</span> = mp.encode();
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">mp2</span>;
<span style="color: #73d216;">// </span><span style="color: #73d216;">in place, decode+append</span>
mp2.decode_append(msg);

<span style="color: #73d216;">// </span><span style="color: #73d216;">return constructed</span>
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">mp3</span> = <span style="color: #e9b2e3;">multipart_t</span>::decode(msg);
</pre>
</div>

<div class="caution">
<p>
Take care how this last one is a static class method.  You can call <code>mp.decode(msg)</code> and it returns a new <code>multipart_t</code> and does not touch the object <code>mp</code> used to call it.
</p>

</div>

<p>
Here's the codec exercised with free functions.  They have the added flexibility to operate on buffers.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #8cc4ff;">message_t</span>&gt; <span style="color: #fcaf3e;">msgs</span>, <span style="color: #fcaf3e;">msgs2</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">msg</span> = encode(msgs);
decode(msg, <span style="color: #e9b2e3;">std</span>::back_inserter(msgs2));

<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;const_buffer&gt; <span style="color: #fcaf3e;">cbufs</span>;
<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">msg</span> = encode(cbufs);
<span style="color: #8cc4ff;">multipart_t</span> <span style="color: #fcaf3e;">mp</span>;
decode(msg, <span style="color: #e9b2e3;">std</span>::back_inserter(mp));
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org74f4fee" class="outline-2">
<h2 id="org74f4fee">FIN</h2>
<div class="outline-text-2" id="text-org74f4fee">
<p>
That's it.  Go forth and make the next great ZeroMQ application in C++!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2020-04-15 Wed 19:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
